{"meta":{"title":"汪浩然的博客","subtitle":null,"description":"汪浩然的博客","author":"wanghaoran","url":"https://wanghaoranv.github.io","root":"/"},"pages":[{"title":"About","date":"2020-02-17T12:22:25.000Z","updated":"2021-01-13T07:49:16.098Z","comments":true,"path":"about/index.html","permalink":"https://wanghaoranv.github.io/about/index.html","excerpt":"","text":"About me我叫汪浩然，目前仍是一名大学生，学校AHNU，专业Communication Engineering热爱足球，日常有时间会看看书，喜欢数码科技，对很多方面都比较感兴趣尤其是文史类，但往往浅尝辄止，很多东西也不求甚解，不能很深入了解学习 关于职业规划和未来的生活目前想先成为一名前端工程师，然后视情况选择Android开发或者全栈工程师，也会考虑音视频或图像处理方向。目标就是想像接触到的很多优秀前辈一样，不断精进自己的技术，终身学习。当然这些都只暂时是想想，人生的阴差阳错谁也说不准，最后说不定成为了一名光荣的人民教师。 未来的未来想和爱的人去到一个小城里，开一家小吃店和一家旅馆，因为吃和睡要好好被对待。同时在学习工作和生活之间平衡好，做好每个不同的角色。 Blog关于搭建这个博客的初衷，是让自己学会总结并乐于分享交流，如果顺带能鞭策自己，再好不过关于日后的写作内容，作为技术型博客，追求以通俗易理解的方式，去复现知识，尽量避免主观心情，以计算机通信物理领域为主，可能会包含一些足球比赛复盘/读书笔记/游记心得。当然由于知识水平实在有限，若诸位发现文章错误还望指正。 目前博客的功能内容还很简陋，很多东西正在慢慢摸索完善…… 在偌大的世界中，如果你有缘看到了这里，说明对本人和我写的东西还是比较感兴趣，那么不妨交个朋友吧，很乐意被“打扰” ↓"}],"posts":[{"title":"量子力学入门级科普","slug":"量子力学入门级科普","date":"2021-01-11T13:22:35.000Z","updated":"2021-01-18T08:04:23.970Z","comments":true,"path":"2021/01/11/量子力学入门级科普/","link":"","permalink":"https://wanghaoranv.github.io/2021/01/11/%E9%87%8F%E5%AD%90%E5%8A%9B%E5%AD%A6%E5%85%A5%E9%97%A8%E7%BA%A7%E7%A7%91%E6%99%AE/","excerpt":"遇事不决，量子力学？ 薛定谔的猫是怎么一回事？关于薛定谔这个人又有什么八卦花边呢？ 神奇的物理量子世界，确定不点进来看看吗？ 这篇长文实在难写，越写越烦，花了好几天时间，越到后面越觉得是哲学和玄学。","text":"遇事不决，量子力学？ 薛定谔的猫是怎么一回事？关于薛定谔这个人又有什么八卦花边呢？ 神奇的物理量子世界，确定不点进来看看吗？ 这篇长文实在难写，越写越烦，花了好几天时间，越到后面越觉得是哲学和玄学。 量子这个概念前段时间因为中国量子计算机取得的突破而备受关注，而且一听起来就很高大上的感觉，正好最近在看曹天元写的《上帝掷骰子吗》这本量子力学科普读物，于是来写一写量子物理，也算是做个小小的总结，帮助自己理解。至于量子通信和量子计算机，本来准备一起写，这篇到最后字数已经很多了，而且越发展越难理解，所以看心情会不会另开一篇吧。 虽然《上帝掷骰子吗》这本书目的是让没什么基础的人也能稍微了解物理和量子的发展，但我觉得里面有些内容真的不太好看明白，估计跟书无关，是量子本身确实太难理解了。 人类未来50年最急需突破的两个尖端科学领域，一个是可控核聚变，这个涉及到能源问题，实现后就真正掌握了如外挂一般的“无限能源”，这也为人类探索外太空、走向星辰大海提供可能。另一个就是这里有关的量子计算机，简单来说就是，量子计算机的计算效率比普通的计算机高上指数倍。当然量子计算机和量子本身还是有差别的，具体后面再详细展开。 量子不仅听起来高大上，确实本身它就很神秘，有时候有一种超出人类认知的恐怖和窒息感……以至于1900年首次提出这个概念的普朗克，也就是量子的创始人，都对量子持怀疑态度（自己都不相信自己搞出来的东西是对的）。 而人类确实到目前为止也没能真正理解量子力学背后的原理，只能如盲人摸象一般，只见一斑而不可知全貌。 我下面写的这些主要是用我自己的语言对那本书内容简洁的复述，当然也有我自己知道的一些东西。 对光的认识我们从光开始讲起，光是每个人见得最多的东西，也是最重要的东西，可以说没有光就没有地球，甚至没有一切。我们似乎对光的存在已经习以为常，那么光到底是什么呢？是可以被看见的，但又摸不着……历史上科学家们对光的本质来来回回争论了很久，主要有两种说法：粒子说和波动说。 这两种说法在历史上的激烈的讨论影响深远，意义重大，催生了量子的出现。 粒子说粒子说认为，光是由粒子流组成的。 我们知道，物质由原子分子等基本粒子组成，分到最后不可再分基本粒子是夸克。那光也可以同理，光是由一粒一粒非常小的粒子组成的。最开始的猜测很简单，光直线传播，碰到遮挡物就被遮住，还有反射、折射、牛顿三棱镜分光实验种种可以直接观测到的现象，这些证据都指向了光是由粒子组成的。 波动说随着实验条件和科学理论的进步，人们通过一些现象发现粒子说是错误的，转认为波动说是对的。 波动说认为，光是本质上是介质振动产生的波。光的波长很小，频率很大，波速就是光速。 那有一个问题来了？真空中没有介质，光为什么也可以传播呢。科学家们为了解释包括光的介质问题，和其他各种百思不得其解的现象，由哲学引入了一个绝对静止的概念——以太。他们认为，以太存在于一切当中，有点像空气的感觉，但不是空气，不对物体有阻力和其他作用，就静静地存在，为光的波动提供介质。后话来讲，这个概念是错误的，但在当时，以太是经典物理学的支柱，正由于以太的存在，很多事实在当时才能解释的通。 波动说的证据的主要有以下三个实验： 01.杨氏双缝干涉实验我们普通实体在通过双缝之后，打到墙上应该形成两道相对应的竖双缝条纹。如下图，发射的小球经过两条缝，打到墙上也是两条竖线： 但是，波就不一样了，波在通过极窄的缝隙时，会形成“衍射”现象。简单讲就是像水波一样，经过两条缝之后，是扩散开来的，不单有两条缝。 托马斯.杨当时完成了这个实验，光通过两条细缝后，会出现明暗相间的光条纹，这有力说明了光是一种波，而不是粒子。 02.菲涅尔圆盘衍射和泊松亮斑正常来讲，在光源前放一个圆盘，光会被遮住，但神奇的是，实际上光穿过圆盘之类的障碍物时，会发生偏离原来直线传播的物理现象，我们叫做圆盘衍射。这些物理定义听上去很复杂，其实就是圆盘挡不住光，在后面的阴影处也能有光射到。当然完成实验需要的条件比较苛刻，日常肯定看不见。 菲涅尔提出的这个想法，并完成了数学证明。但泊松这个人头铁，始终不相信光是波，并认为如果圆盘衍射是真的，那应该会在圆盘后观察到光啊。果不其然，实验中在圆盘后观察到了一个亮斑，这个亮斑被误打误撞叫成了泊松亮斑，实际上不是他做出来的，只是用他的名字来命名。圆盘衍射和亮斑的出现，又有力说明了光是一种波，而不是粒子。 中间的小亮点就是泊松亮斑 03.赫兹的电磁波实验这个实验装置比较特殊，过程原理都比较复杂，我也没能完全弄明白，就不展开讲了。只要知道实验隔空观测到的电火花，说明了电磁波的存在，随后赫兹还测出了电磁波的速度就等于光速，这又有力说明了光是一种电磁波。 总之，这个实验一经发布，就轰动了整个科学界，证实了电磁波的存在，开创了无线电的新纪元，同时，光是一种波似乎成为板上钉钉的事实。 赫兹的实验装置 经典物理的黄金时代赫兹的这个实验除了说明光是一种电磁波，还证明了之前麦克斯韦的想法的正确。麦克斯韦将电磁场基本定律归结为四个微分方程，这就是著名的麦克斯韦方程组。这是他用数学严密推导出来的，还没在实验上验证，赫兹的实验完成了这一步骤。麦克斯韦方程组 “麦克斯韦方程组揭示了电场与磁场相互转化中产生的对称性优美，这种优美以现代数学形式得到充分的表达。”它的背后的物理意义重大，却简洁优美，让历史上无数科学家为之折服惊叹，甚至有些许夸张地被誉为“最完美的公式”。 经典物理发展到赫兹完成实验那里，似乎天衣无缝，令人叹为观止，牛顿的经典物理学体系早已金碧辉煌、成果丰硕，现在电磁学领域也迎来了高峰，在法拉第、麦克斯韦、赫兹等人的传承和发展下，一切都那么完美，各个理论彼此包容相互印证。经典力学、经典电磁学、经典热学紧密结合，构成了经典物理学的三大支柱。 然而，是的，熟悉套路的朋友们一定知道，每次一切都看上去都很好的时候，总会有幺蛾子出现…… 背后的乌云19世纪末（确实那个时代很伟大），正当科学家们沾沾自喜，认为已经建立了高度成熟的物理体系时，又出现了一些人们无法解释的现象，甚至和传统理论背道而驰，这些无法解释的现象有了个深入人心的比喻，“物理学灿烂天空下的两朵小乌云”。 这两朵著名的乌云分别是： 经典物理在光以太上的困境（具体一点就是，迈克尔逊-莫雷实验） 麦克斯韦-玻尔兹曼能量均分学说上的困境（具体一点就是，黑体辐射研究） 这些个词听上去就很复杂，我们无需展开，只要知道： 第一朵乌云，引发了相对论革命； 第二朵乌云，引发了量子论革命。 我们主要讲量子，也就是第二朵乌云，黑体辐射研究。 从黑体辐射研究中提出的量子普朗克提出了量子黑体，是一个理想化的物体，它能够吸收外来的全部电磁辐射，并且不会有任何的反射与透射。简单打个比方，黑体就是一个黑洞洞的房间，只有一个小小窗户能往里看，并且看进去一片漆黑。 人们在研究黑体能量辐射时，发现辐射进去的波，长波短波能用的公式竟然不一样，这是不正常的现象。打个比方，两套衣服，其中一套穿起来裤子长了，但上衣合适；另一套衣服，穿起来裤子合适，但上衣又长了。两套还没办法混合穿，这多尴尬。 量子的创始人普朗克为了解决这个问题，自己凭借灵性猜测、组合、拼凑，找到了一个两种情况都通用的公式（真强）。但这个公式只是从数学角度来表达，背后的物理意义到底是什么呢？ 普朗克苦苦思考了很久，结果就是，要想解释自己的新公式，必须假设能量的发射和接受是一份份的！这个假设是很爆炸很颠覆性的，因为之前经典物理的一切，都是建立在能量是连续的基础上，不存在最小单位，数学上微积分的思想也是连续的。 打个比方，温度要从20摄氏度上升到50摄氏度，中间必须要经过40摄氏度这个点，这是连续；从家到学校必须经过路中间的一个必经点，而不能闪现过去，这也是连续；在电玩城打游戏，代币一枚一枚存在，一枚一枚投进去，这是不连续的。 什么是量子普朗克的假说就认为，能量不是连续的，而是一份份的。这个份，就是不可再分的最小单位，而不能有半份。我们把一份，叫做能量子，也叫量子。所以量子并不像原子、分子那样，是一个实在的粒子，而是一个单位，一个概念。 普朗克对自己亲手提出来的东西疑惑不已，不敢相信，因为这否定了之前物理学辉煌的一切，包括神坛上的麦克斯韦方程组。 爱因斯坦和光电效应过了5年，也就是1905年，量子理论取得了进步。推动的是一个在人类历史上都赫赫有名的牛人——爱因斯坦，他提出了光电效应，和光的量子化。要知道，爱因斯坦后来最大的成就可是相对论……这些成就任意一个都足以载入史册，他却接二连三搞出了多个。不过从爱因斯坦给朋友的信中可以看出来，他自己认为光量子的颠覆性比相对论还要高一点。 注意，我们对于光本质的争论还没有结束，由于赫兹的实验，人们信誓旦旦认为光是一种波，直到光电效应的出现。 光电效应具体限于篇幅，就简单讲一下。光电效应是一种光生电现象，用足够高频率的光照射金属时，会有电子溢出。对特定的金属，能不能打出电子，由光的频率决定，能打出多少电子，由光强说了算。 奇怪的是，这个结论无法用波的理论解释，因为按照波动理论，波的强度就代表了能量，按道理应该决定能不能打出电子，这反而与光电效应中的事实恰恰相反。 爱因斯坦在看到普朗克的量子后，为了说明光电效应中的邪门现象，大胆提出了光量子的假设——光是由一份份的光量子组成，并基于光量子，用数学证明，很好解释了光电效应的现象。 爱因斯坦光量子的说法，把光又当成了粒子。 康普顿的X射线实验爱因斯坦只是作出大胆假设，指出了理论上的可能性，而美国科学家康普顿1923年对X射线的实验，真正让人们“看到了”光量子。这个实验简单讲就是，拿X射线（伦琴射线）射向实物物质，穿过后出来的射线发生了散射，这同样由电磁波动理论无法解释，但尝试用光量子学说解释后，竟完美符合——一份份的光量子与电子碰撞，导致散射的发生。 这让人糊涂了，光怎么还是粒子啊，兜兜转转又回到最初的起点，那光身上体现出的波动现象又怎么解释呢？ 在光粒子说和波动说的反复拉扯情况下，两边都不能很好地完全解释，人们无奈只好折中一下，开始意识到，光既是由波组成的，也是由粒子组成的。我们把这叫做光的波粒二象性。 由光到所有物质德布罗意波终于在意识到光的波粒二象性后，又一位牛人出现了，法国科学家德布罗意，1924年他从爱因斯坦著名的质能方程和量子基本方程开始考虑，借助相对论理论，经过一系列推导，最终得出了一个惊人的结论：电子在前进时，总有一个波出现。这就意味着，电子竟然也是一种波！我们把这种波叫做德布罗意波，也叫相波。德布罗意将这个发现写在了他的博士毕业论文中，在顺利毕业的同时，年纪轻轻就凭借这篇论文获得了诺贝尔物理学奖。 可是我们早就知道，电子已经是一种粒子了啊…… 相波的发现，把人们仅仅对光的是粒子还是波的争论，延伸到了电子上，后来又延伸到了所有物质上，那么物质到底是粒子还是一种波呢，或者说既是粒子又是一种波。 德布罗意物质波的提出让人们对之前的经典物理学产生了怀疑，所有科学家都变得迷茫和不知所措起来。 所有物质的波粒二象性光有波粒二象性，电子有波粒二象性，现在所有物质似乎都有波粒二象性，这是很恐怖的一件事，你能想象物质既是由粒子组成的，也是由波组成的吗？包括你我，你能想象自己的身体，在某一刻变成了“波”，可以穿墙而过吗？ 有人可能会疑惑，粒子和波之间的差异真的有那么大吗？我来打个比方，帮助大家理解粒子和波之间的行为差异。 粒子是离散的，我们开枪打出子弹，一定是一粒一粒的，一次只能朝一个方向射出去，这是粒子性。不可能扣动扳机，各个方向都有子弹，所有人都被击中。而波的行为方式是连续的，你进行一场演讲时，在场的所有人都能听见，而不会一次只有一个人听见。 由此可见，宏观世界的物体一次都只体现一个性质，要么波动性，要么粒子性，不会有二象性。但在量子领域，种种事实告诉我们一切物质都有波粒二象性。 我们研究量子，实际上视角越来越细微，从微观世界找寻物质的本质，放大到宏观世界还是遵循经典物理那一套理论，这之间为什么有差异呢，这是量子的特性决定的。 一个“恐怖”的实验前面我们说到了经典的杨氏双缝干涉实验，它说明了光是一种波。但在量子领域，也就是微观领域，如果电子也有波动性，那么也应该能做出双缝干涉实验。 但是当人们开始做电子衍射实验时，却发现了“恐怖的现象”。 现在设想如果将连续的电子流通过双缝，打向屏上像经典的杨氏双缝实验那样，结果无疑会出现明暗相间的干涉条纹 那如果单个电子一粒一粒射向双缝，会出现什么现象呢？因为每次只有一个电子子通过双缝，要比较长一段时间后，才会在屏幕上留下综合痕迹。两条缝，一粒电子一次只能选择一个通过，就应该不会出现干涉现象。因为只有两条缝同时有波，即便电子是波，也至少在两条缝都有，才会有干涉。但是，实验现象却是，单个电子通过双缝，也能看到干涉条纹，也发生了干涉！这很不可思议，只能解释成单个电子一分为二，自己和自己发生了干涉。 现在又进一步，在两条缝装上一种特殊装置，能够检测到电子到底通过哪一条缝奇怪的事又发生了，干涉现象居然消失了，这意味着什么，说明你一旦想看电子，电子波的性质就躲起来，老老实实变成粒子了…… 虽然人们不愿相信，但确实是实实在在观察到了这些物理现象。 科学家们为了解释不合常理的现象，进行了种种探索。 海森堡和薛定谔的突破物理学是建立在数学上的，没有数学的物理，就只是逻辑上的脑补产物。所以科学家们一定追求用一些数学工具解释物理现象。 海森堡和薛定谔研究是内容就是，寻找一套合适的理论（包括数学公式和物理意义），来描绘发生在电子身上“既是波又是粒子”怪异现象。 他们俩最后成果给出的数学公式虽然可以被证明相互通用，但出发点是两个不同的角度，海森堡和薛定谔之间也互相不认可，都认为对方是错的。 薛定谔的波动函数在讲薛定谔在量子领域做出的贡献之前，先八卦一下薛定谔的私生活乛◡乛据说薛定谔面对女性来者不拒，每次和慕名而来的女孩子doi之后都会灵感迸发，变得极富创造力。他关于量子力学论文发表最频繁的那段时间，就是他没带原配，找了个神秘女郎前往阿尔卑斯山度假的那段时间…… 薛定谔的想法具体也很复杂，在这里简单说一下。薛定谔从连续性的观点出发，得出了一个波动方程，这个波动方程用来解释量子现象很合适。 波动方程，听名字就是知道这个理论把电子认作了是波，虽然薛定谔也承认电子有粒子性，但究其本质还是一种波，极小的波叠加在一起显示出粒子性。 波动方程的物理意义是：一种随机、一种概率，不是薛定谔本人理解的电子电荷在空间中的分布，是电子的出现概率像一个波。频率高的地方就是干涉条纹的亮处，频率低的地方就是条纹暗处，每个电子的行为是随机的，但随机分布的总的模式是确定的，是一个干涉条纹的图案。 这个理论被进一步发展，就形成了量子力学最重要的基础“波函数”。 海森堡的不确定性原理不确定性原理，我认为是量子论入门最核心的一个观点，却涉及很多深刻的哲学问题。 海森堡最初主要的思路是，不要先入为主地构建一些物理模型，不作假设和推论，从数学上出发，数学上是什么就是什么，不再被经验主义迷惑。总之，他从不连续性出发（也就是粒子的特性），创建了矩阵力学，用来解释微观现象、描述量子状态。 后来海森堡又在矩阵力学的基础上，进一步思考出了一个意义重大的原理：不确定性原理 不确定性原理的核心思想就是：你不可能同时知道一个粒子的位置和它的速度。为什么？因为“观测”！我们获知外界的一切信息，靠的是什么，是观测。 所有的信息，例如，速度，大小，重量等等，都是要依靠某种介质来探测并反馈给你。打个比方，你能看到帅哥美女，是光子照到他们身上，再反射到你眼里；你能通过显微镜观察到很小的粒子，本质上还是光子射向被观测的粒子，反馈给你。 这是宏观层面，一旦到了微观粒子层面，就变得很不一样了，所有的观测，都会扰动原来的粒子，原来粒子的信息都会在被观测到的一瞬间发生改变，再也无法准确获知原来的信息。我们的测量对象如此微小，以至于我们的介入对其产生了致命干预。 是的，粒子的位置可以通过某些手段知道，但速度一定会发生改变，二者不可兼得。 宏观是由无数个微观组成的，关键就在于微观粒子层面太小了，宏观和微观的数量级之间差别太大了。可以这样想象一个场景，世界的一切都是由无比微小的粒子组成，包括我们，没有其他存在，只有生冷的粒子，它们之间发生扰动…… 直到观测的出现，可观测又是什么，似乎是一个很不准确的用词，动物能观测这些吗？显微镜能观测这些吗？ 只有人才能叫做观测，可人和动物和显微镜有什么区别呢？……观测似乎是意识。多么玄学，科学本该是追求准确的，但到量子身上竟然牵扯到了奇怪的意识问题。 于是像上面那个单电子衍射现象，就可以解释为，电子原本是一个波，按照波函数的方式运动，一旦被观测到，所有的可能全都瞬间集中到某一点上，就变成了粒子，只要不观测，就一直是波。是观测让波变成了粒子，是意识使波函数坍塌成粒子的一个小点。 可电子怎么知道自己被观测到了呢？这是瞬间完成的……你的意识和电子之间没有任何提前的联系啊……多么恐怖。 不过为什么说量子力学是一个“黑箱”呢？ 原因就是，当前的科学理论，仍然还不知道，这个粒子为什么会从“概率云”坍缩为一个确定的点，这个坍缩的原理是什么，是如何发生的，我们是无从得知的。 可能有人有疑问，按照量子力学的说法，万事万物都是波函数，那么为什么我们宏观物质是存在确定性的呢？因为在宏观物质里，时时刻刻都在发生着坍缩。当然这只是一种派别的说法。 哥本哈根派量子论的观点这是量子力学的主流版本，量子力学发展初期，主要是由玻尔在哥本哈根和海森堡创立的哥本哈根学派，这学派成员在玻尔带领下，以惊人的爆发力，为量子力学构建做出了重要的奠基作用。 主要思想就是： 不确定原理 概率解释 互补原理 其他派对量子论的解释主要有： 多世界理论：简单讲就是，波函数无需坍塌，叠加态会分成两个平行的确定态，平行存在，我们能感知到的一切都是其中一个宇宙，像科幻小说里的平行世界一样 隐变量理论：简单讲就是，我们不能解释一些量子现象的原因就是，还没发现或者观测到，确实存在的一个隐变量对我们现实造成的影响 退相干理论 等等 至于一直存在很多派别，原因就是每一个派别都无法很好完全解释量子现象，甚至有些理论要涉及到类似：意识，平行世界，宇宙起源一些很飘渺的概念……至今人们也无法统一起来，量子依然还很玄幻，只知现象，不知原理。 当然包括爱因斯坦在内的一些科学家尝试建立起一个大统一理论，这个理论试图真正发现世界的本质规律，所有的一切遵循大统一理论发展，不过目前看起来希望很渺茫。 是不是真的有这样一个能够揭示一切的理论呢，如果确实找到之后，科学就会停滞不前了吗？ 薛定谔的猫薛定谔的猫早已被人们熟知，这个物理史上最有名的动物，是源自薛定谔的一场思想实验，它将原本属于微观粒子层面的量子现象，放大到了宏观层面，直观被人们感知。 薛定谔假设，将一只猫关在装有少量镭和氰化物的不透明黑箱子里。镭的衰变存在几率，如果镭发生衰变，会触发机关打碎装有氰化物的瓶子，猫就会死；如果镭不发生衰变，猫就存活。按照量子力学的原理，原子核的衰变是随机事件，也就是镭是否在某一时刻衰变，是概率的。那么我们在具体观察这只猫之前，理论上这只猫会处于一个“非死非生”的叠加状态。只有我们实际打开箱子查看这只猫的时候，才能确定知道这只猫究竟是死是活。 这违背了事实，猫怎么可能处于又死又活的叠加状态呢。 按照哥本哈根派的解释，当外界观测这只猫之前，这只猫有点像处于“概率云”状态，在我们观测一瞬间，这个概率云才会发生坍缩，变成要么死，要么活的两个结果。按照多世界解释，在我们观测一瞬间，宇宙会分裂成两个，一个宇宙里这个猫死了，一个宇宙这个猫还活着。 最后的一点感悟科学是什么？哲学又是什么？ 纵观整个科学史，无非是人类在一群天才带领下，在一片混沌中找寻微光的过程，正是由于这混沌足够黑暗，才更衬出光亮的弥足珍贵。 每当人们沾沾自喜地为已经取得的成就稍稍满意时，科学或者说是事实就会跳出来给出当头一棒。就像一个强大到一无所知的对手打倒你，然后用无比冷酷的表情，轻蔑一笑，这笑恐怕比再多话语都要令人感到窒息。于是人类又跌跌撞撞爬起来，抖抖身子，回头看看来时的路，接着思考要往哪里去…… 事物总是曲折前进螺旋上升的，无论怎样，相信希望，热爱生活。","categories":[{"name":"总结","slug":"总结","permalink":"https://wanghaoranv.github.io/categories/%E6%80%BB%E7%BB%93/"}],"tags":[{"name":"量子","slug":"量子","permalink":"https://wanghaoranv.github.io/tags/%E9%87%8F%E5%AD%90/"},{"name":"物理","slug":"物理","permalink":"https://wanghaoranv.github.io/tags/%E7%89%A9%E7%90%86/"}]},{"title":"对傅里叶变换的一点理解","slug":"对傅里叶变换的一点理解","date":"2021-01-07T05:59:14.000Z","updated":"2021-01-16T12:47:46.836Z","comments":true,"path":"2021/01/07/对傅里叶变换的一点理解/","link":"","permalink":"https://wanghaoranv.github.io/2021/01/07/%E5%AF%B9%E5%82%85%E9%87%8C%E5%8F%B6%E5%8F%98%E6%8D%A2%E7%9A%84%E4%B8%80%E7%82%B9%E7%90%86%E8%A7%A3/","excerpt":"这次来讲一点自己老本行的东西，之前乱起八糟地写，万一写得不好被人喷，还有理由狡辩一下。如果写自己专业的知识出了大岔子......","text":"这次来讲一点自己老本行的东西，之前乱起八糟地写，万一写得不好被人喷，还有理由狡辩一下。如果写自己专业的知识出了大岔子...... 开个玩笑，建这个博客就是让自己大胆表达出来的，不会怕什么，肯定有不准确的地方，如果写错了，欢迎指出来。考研看了那么久的书，不管考没考上，学到的知识总得留下点痕迹。 只要你学通信干这行一定绕不过傅里叶这个让人无比头疼的人，而且在考研学政治期间，好像又知道了傅里叶在政治学领域同样干出了点成绩，真是会来事啊。 很多兄弟们在刚学傅里叶变换的时候，一上来绝对会被许许多多纷繁复杂的积分式、求和式冲昏头脑，一脸懵，而且式子之间的差别很细节，容易混淆。我个人认为这并不是刚学一个新知识比较好的状态。最好要先从总体上大致了解所学的东西是为了解决什么问题，解决了哪些问题，达到了怎样的目的，然后再在框架内理解细节。 霍金大佬也在《时间简史》中提到：“每插入一个数学公式，就会使作品的销量减半。” 所以本文尽量以直观易理解的方式，绕过那些尽管准确但初学可能难理解的公式，从总体上讲一讲我对傅里叶变换的一些理解，然后延伸到拉普拉斯变换，同理再讲到离散域的Z变换，道理大差不差，核心当然是傅里叶变换和傅里叶级数展开。Here we go 什么是傅里叶变换什么是傅里叶变换（Fourier Transform）？傅里叶变换又到底干了些什么呢？ 用一句话来描述，傅里叶变换就是一种 把满足一定条件的信号 从时域转变为频域的变换。 这里提到信号需要满足的一定条件，就是狄利克雷（Dirichlet）条件。即： 有限个间断点 有限个极值 绝对可积（积分值不能无限大） 那万一不凑巧，不满足这个条件怎么办呢？这时候我们就要乘一个收敛因子（衰减的复指数函数），强行让信号满足绝对可积这个条件。这也就是我们后面拉普拉斯变换的背景，因此可以理解为拉普拉斯变换是更广义的傅里叶变换。 回到上面的那句定义，来讲一讲变换以及时域和频域 变换对图形旋转、平移等等是一种变换；对初始一串杂乱无章的数字按规律排列是一种变换；自变量x通过某个函数对应到因变量y也是一种变换；这里的傅里叶变换同理，只不过我们称变换前在时域，称变换后为频域。实际上你回看傅里叶变换的那个公式，就是一个积分式，当然算是一种函数变换。 时域和频域我们生活在这个世界，时间一定是单一维度且是线性不可逆转的，所有事物被裹挟着滚滚向前，这就是我们在信号上讲到的时域，通俗理解就是时间领域，即随时间推移，事物（信号）是怎么样子变化的。我们生活中正在发生的都在时域层面。 那频域又是怎么一回事呢，这是比较抽象难理解的一个概念，因为我们日常接触不到，无法感知，所以就要靠想出来。它是数学层面构造出来的，是虚构的，虚构但意义重大。人类社会正是由于相信许许多多虚构的事物才变得繁荣精彩起来，这是《人类简史》中反复提到的观点。 频域，即频率域。频率又是什么，是单位时间内完成周期性变化的次数，打个简单的比方就是1秒钟能抖多少次，这个次数就是频率的值，当然还可以知道这个值是周期的倒数。哲学上讲，任何物体都在运动，运动是物质存在的形式。事实上确实每个物体都有频率，原子、分子、人都有自己的固有频率。 所以频率域是另一种看世界的角度，这个角度从频率出发，用频率来描述一切。 再打个比方，这个比方不是我想出来的，但很贴切：我们听到的一首悦耳的歌，有抑扬顿挫，有高音低音等等，这就是时域层面的，比较直观；但专业的歌手、乐手们要会看各种音符，并能根据音符唱出来或弹奏出来，用音符来描述歌曲，就相当于在频域角度看世界，比较抽象，但更准确。 很巧妙很有跪感的一张图，红色的波：时域的波形；蓝色正弦波：分解成的正弦波；旋转后侧面的视角：频域；旋转后几根小棍儿的蓝色图：频域图 ；图源：Wiki百科 傅里叶级数是什么傅里叶级数的概念要先于傅里叶变换，傅里叶变换是傅里叶级数的推广。 傅里叶最初提出的想法是：任何周期函数，都可以看作是不同振幅，不同相位正弦波的叠加。 这就是说，不管再复杂的周期信号，都可以看成是多个简单正弦波信号的组合相加来进行逼近。由于组合方式有很多种，所以最终出来的信号就有很多种。打个比方，不管再复杂再细腻的颜色，都可以用红黄蓝几个基本的颜色来调出来，由于你调制分配的方式有很多种，所以最终出现的颜色就有很多种。再打个比方，不管用天平称多重的物体，只要基本的砝码组合够完备，我们都能称出任意重量出来，是由于砝码搭配的方式有很多种，所以最终能称的重量就有很多种。 这种正弦波信号的组合式，就是傅里叶级数。它还仅仅停留在时域层面，并没有像傅里叶变换涉及到频域。 那你怎么找出是哪些正弦波组合呢，我所知道的就是用傅里叶级数公式。 注意这里进行傅里叶级数展开的前提一定是：周期函数，如果不是一个周期函数（非周期函数），就成了傅里叶变换。周期信号做傅里叶变换可以得到一组傅里叶级数。 非周期函数可以看成一个周期为无限大的周期函数，因此还可以继续用正弦波信号组合来不断逼近，但由于周期无限大，频率就无限小，无限小到连续，故对应到频域就不是离散的，就成了连续的曲线。 为什么一定是正弦波信号当然余弦波信号也可以，只是相位不同。对啊，原本的矩形波、方波等等不也挺规整的吗，看上去舒舒服服，有棱有角，还容易表示，为什么必须用三角函数展开呢？这我之前根本没想过，现在查资料才看见解释，很有讲究，直接贴在这里。 用正弦曲线来代替原来的曲线而不用方波或三角波来表示的原因在于，分解信号的方法是无穷的，但分解信号的目的是为了更加简单地处理原来的信号。用正余弦来表示原信号会更加简单，因为正余弦拥有原信号所不具有的性质：正弦曲线保真度。一个正弦曲线信号输入后，输出的仍是正弦曲线，只有幅度和相位可能发生变化，但是频率和波的形状仍是一样的。且只有正弦曲线才拥有这样的性质，正因如此我们才不用方波或三角波来表示。 ————来自百度百科 为什么偏偏选择三角函数而不用其他函数进行分解？我们从物理系统的特征信号角度来解释。我们知道：大自然中很多现象可以抽象成一个线性时不变系统来研究，无论你用微分方程还是传递函数或者状态空间描述。线性时不变系统可以这样理解：输入输出信号满足线性关系，而且系统参数不随时间变换。对于大自然界的很多系统，一个正弦曲线信号输入后，输出的仍是正弦曲线，只有幅度和相位可能发生变化，但是频率和波的形状仍是一样的。也就是说正弦信号是系统的特征向量！当然，指数信号也是系统的特征向量，表示能量的衰减或积聚。自然界的衰减或者扩散现象大多是指数形式的，或者既有波动又有指数衰减（复指数形式），因此具有特征的基函数就由三角函数变成复指数函数。但是，如果输入是方波、三角波或者其他什么波形，那输出就不一定是什么样子了。所以，除了指数信号和正弦信号以外的其他波形都不是线性系统的特征信号。————来自百度百科 上面这样的两大段比较长，信息量其实非常大，讲得很好，我自己来总结复述一下，为什么必须要用正弦波信号表述： 正弦波来代替原信号更简便，最关键在于，正弦波信号有正弦曲线的保真度，即，波的变化只涉及振幅相位，还是正弦波波形不变 从物理系统特征信号角度来解释，正弦波是自然系统的特征向量，当然指数信号也是自然系统的特征向量，因此傅里叶变换有指数形式。 为什要进行傅里叶变换前面提到，傅里叶变换是一种时域频域之间的变换。当我们从时域层面不好分析，不好处理时，就想着换一种思路，换一种角度，来到频域，这就是傅里叶变换存在的意义——最终为了方便我们分析事物。 按道理这时候要举出一些例子，来说明从频域里分析确实方便不少，但我还没学到那种程度，只知道频域在奈奎斯特准则上的体现，其他自己确实还没体会到一些实际应用上的精妙之处，自然就写不出来。 这里就再剽窃一下别人的智慧，复述一下别人生动的比喻（别人真强）。有一杯水果冰沙，我们除了喝起来爽歪歪，还想知道冰沙里有哪些水果，放了多少勺糖之类，就利用傅里叶变换这个工具，把它看成是一个可以分离成分的神奇漏斗，我们把冰沙经过傅里叶变换这个分离器，便得到了例如，两份橘子，一份牛奶，一份香蕉，三份糖的具体成分，如果我们想再甜一点，把三份糖换成四份，想多喝奶，就换成两份。注意这里的单位是一份一份，这里的份，就对应如果是周期信号的基频，基频的整数倍。不管怎么变来变去，总量一定不变。 这就非常形象说明了傅里叶变换的用处。我们不仅要关注一杯做好的冰沙，也同样关注不同配料成分，这是两个不同的角度。 拉普拉斯变换和Z变换本文暂时就到此为止了。嗯，原因就是不想写了，好吧，其实是有些东西写着写着我也糊涂了，还有太多内容要讲。以后有缘再更。","categories":[{"name":"信号与系统","slug":"信号与系统","permalink":"https://wanghaoranv.github.io/categories/%E4%BF%A1%E5%8F%B7%E4%B8%8E%E7%B3%BB%E7%BB%9F/"}],"tags":[{"name":"傅里叶变换","slug":"傅里叶变换","permalink":"https://wanghaoranv.github.io/tags/%E5%82%85%E9%87%8C%E5%8F%B6%E5%8F%98%E6%8D%A2/"},{"name":"信号","slug":"信号","permalink":"https://wanghaoranv.github.io/tags/%E4%BF%A1%E5%8F%B7/"}]},{"title":"足球复盘：拜仁慕尼黑vs美因茨","slug":"足球复盘：拜仁慕尼黑vs美因茨","date":"2021-01-04T13:05:54.000Z","updated":"2021-01-16T08:49:37.460Z","comments":true,"path":"2021/01/04/足球复盘：拜仁慕尼黑vs美因茨/","link":"","permalink":"https://wanghaoranv.github.io/2021/01/04/%E8%B6%B3%E7%90%83%E5%A4%8D%E7%9B%98%EF%BC%9A%E6%8B%9C%E4%BB%81%E6%85%95%E5%B0%BC%E9%BB%91vs%E7%BE%8E%E5%9B%A0%E8%8C%A8/","excerpt":"离上次写足球复盘已经过去差不多一年了，谁也没想到的是刚写完上一篇随后国外疫情也爆发开来，所有比赛立即停摆，第二回合的淘汰赛不知道隔了多久才重新举行，赛制也改成了单回合制。上次结尾提到的莱万和科曼受伤也在休赛期间养好了，之后的故事大家都能看得见，我小破仁一路披荆斩棘，最后拿下了欧洲冠军。","text":"离上次写足球复盘已经过去差不多一年了，谁也没想到的是刚写完上一篇随后国外疫情也爆发开来，所有比赛立即停摆，第二回合的淘汰赛不知道隔了多久才重新举行，赛制也改成了单回合制。上次结尾提到的莱万和科曼受伤也在休赛期间养好了，之后的故事大家都能看得见，我小破仁一路披荆斩棘，最后拿下了欧洲冠军。 这是多么魔幻又梦幻的一年啊，19年主场家门口惨败利物浦时，多少人态度悲观，不止一次提到球队的重建期还很长，罗本里贝里拉姆等上一批功勋接连退役，新生代一众似乎还很稚嫩很难扛起大梁，怎么也不会想到仅仅需要一年时间，拜仁慕尼黑就能再次站上欧洲之巅。其中最要感谢的就是神奇主帅弗里克，扫地僧一般的角色。 夺冠之路上的具体战术踢法思路和上一篇提到的那样大体相似：强调高位压迫、强调边中结合，当然这也是拜仁的老传统了。不可否认的是，不同于以往赛季的人员不整，充满遗憾，长休赛期之后的单回合制比赛，给拜仁这种受伤病影响严重的球队一次难得的机会，全员出战的拜仁就是最强的拜仁。 原本想重看一次欧冠决赛录像，记录下来，但时间已经过去那么久了，球队人员变动也比较大，过去的辉煌就留在过去吧。今天来回顾2021年的第一场比赛，也是圣诞冬歇期回归后的第一场比赛： 20-21赛季德甲第14轮：拜仁慕尼黑主场对阵美因茨，最终比分5：2 前沿北京时间1月4日凌晨01：00，刚刚结束假期的两队进行了回归后的第一场比赛，拜仁慕尼黑排名德甲榜首，美因茨则已经几轮未尝胜绩，深陷降级区。对于拜仁来说，他们的联赛火力无需多言，只是后防水平实在难以让人满意，很难有几场零封对方的比赛。 在与多特蒙德那场比赛中韧带受伤缺席近两个月的基米希终于火线复出，没有他的拜仁变得极不稳定，这位精神属性极强、永远充满斗志的小伙子正向着德国拜仁双料队长的方向大步迈进。拜仁这边的总体伤病情况还算可以接受，除了前段时间过于疲劳扛着球队前进的科曼有伤修整外，老将哈维马丁内斯也因伤休战。 首发阵容 首发， 图源：见水印 拜仁慕尼黑依然采取了4-2-3-1的阵型，一招鲜吃遍天，虽然弗里克之前也尝试过其他套路，但最后还是回归老传统，没办法，似乎只有这样才能把大家捏合起来，就是这样粗暴有效。美因茨选择了4-1-2-1-2这种奇怪的站位，乍一看图，中间细长……就大概能知道他们的套路了——收紧中路，放开两边，但要站住禁区外的两肋，防守为主，伺机偷一个。这大概是德甲弱队面对拜仁这种强大对手采取的普遍做法。 打法浅析拜仁一以贯之，优先选择通过边路进攻，这也从赛后数据统计和热点图直观反映出来，比较让我吃惊的是，拜仁在禁区弧顶部位的存在感如此之弱，近乎真空，当然这里似乎也是美因茨防守最密集的地方。 热点图，图源：见水印 图源：见水印 前面提到美因茨的这种做法通过收紧中路的同时，找机会快速通过中场大片开阔地，不再拖泥带水，往往只要一两脚的向前的传递，直接将皮球投递到到拜仁的中后场禁区前，拜仁上半场的两个失球正是这个原因。 上半场31分钟拜仁的第一个失球：美因茨中后场直接一脚长传，找到了前场的伯卡特，伯卡特分别扛过博阿滕和帕瓦尔，将球抽射打进。丢球的主要责任在博阿滕和帕瓦尔，这完全不是一个豪门球队的后卫应当有的水平，当然，与全队前场压迫的松懈也有一定关系。这正是球队上半场的真实表现——前场压迫效果有限，几位攻击手边路没打开，中场又未能提供有效保护，后卫还表现不好出现失误。上半场44分钟拜仁第二个失球：同样是美因茨中后场长距离直塞，伯卡特直面后卫想接球却被犯规，拿到了一个前场任意球，任意球开出被头球顶进。除了这两粒进球，还有多次拜仁的防线直接面对对手冲击的情况，面对全队这样糟糕的表现，来到下半场，主帅弗里克作出了调整：换下表现不好且身背黄牌的博阿滕，用聚勒对位换人；换下右路同样表现不合格的帕瓦尔，换上铁腰格雷茨卡，但这并不是对位换人，而是把原先踢后腰的基米希拉到右路。 事后来看，这样思路清晰的调整效果很好，这也再次充分体现了主帅弗里克的功力。上半场守强于攻的帕瓦尔能和边锋萨内打出的配合实在有限，下半场，基米希来到右路，敢于大胆压上进攻，激活了右路，前十分钟的两粒进球也和基米希有关。在换上格雷茨卡后，中场的两位格雷茨卡和托利索的有球组织能力都不强，因此，拜仁的进攻向边路倾斜的更厉害了，尤其是向基米希所在的右路倾斜，通过穆勒莱万伺机向两边靠拢支援，左右边路来回拉扯，寻找空间，拜仁在下半场终于找到了熟悉的进攻感觉。在打出优势之后，一切都变得简单起来，美因茨的体力不支加上士气衰竭，再难有所反抗。 赛况 图源：whoscored.com 总结美因茨上半场的表现已经足够优秀，让人眼前一亮。而拜仁尽管在下半场一鼓作气拿到了五粒进球，但球队在上半场的糟糕表现实在难以高兴起来，整体暴露出的问题也不少，尤其是几个关键位置上的人员储备问题。这场比赛可以通过基米希右倾激活右路，一旦碰上欧冠强队或者人员伤缺情况，这样的套路能否再次奏效？总之，这个赛季的拜仁板凳深度远不及上赛季，要想延续上个赛季的辉煌，难度不小……","categories":[{"name":"复盘","slug":"复盘","permalink":"https://wanghaoranv.github.io/categories/%E5%A4%8D%E7%9B%98/"}],"tags":[{"name":"足球复盘","slug":"足球复盘","permalink":"https://wanghaoranv.github.io/tags/%E8%B6%B3%E7%90%83%E5%A4%8D%E7%9B%98/"}]},{"title":"2020年终总结","slug":"2020年终总结","date":"2021-01-03T06:38:34.000Z","updated":"2021-01-16T13:04:23.456Z","comments":true,"path":"2021/01/03/2020年终总结/","link":"","permalink":"https://wanghaoranv.github.io/2021/01/03/2020%E5%B9%B4%E7%BB%88%E6%80%BB%E7%BB%93/","excerpt":"此时寒潮刚刚褪去，天气晴朗，我终于结束了几天的浪人生活，清醒下来认清现实，正坐在大学教室里敲着键盘——与过去无数次坐在那里一样，写下2021第一篇文章。","text":"此时寒潮刚刚褪去，天气晴朗，我终于结束了几天的浪人生活，清醒下来认清现实，正坐在大学教室里敲着键盘——与过去无数次坐在那里一样，写下2021第一篇文章。 最近看见很多个博主和厉害的人完成的年终总结，便想着自己也可以去做一做。 原本就感性的人其实不想再在这里再留下些情绪上的东西，显得很矫情，而且也与博客创建的初衷相背。但年终总结这四个字听起来就总是少不了记忆、回首和一些假装深沉的思考，所以还是尽量理性地写上一点吧。 关于自己过去一年自己最大的改变就是心态变好了一些，内心打开了很多，不再总是一个人闷在那里胡思乱想，有什么事能通过一些方式表达出来。也开始试着去主动去认识别人，主动与人交流，尽管有时候需要鼓起很大勇气，有时候很笨拙，但我总相信真心待人没有错的。 最让我欣慰的是在准备考研期间能作为倾听者听一位考研学长释放压力，虽然当时自己的情况也没有多好，但这种刚认识就被信任，别人就把内心脆弱的地方显露给你的感觉真的很好。 以前我一直觉得自己是个行为思想都很奇怪的人，总能让气氛变得尴尬起来，总能让别人敬而远之，总能与美好东西失之交臂，至于原因，大概率是既丑又菜，还有个无趣的灵魂。不过现在这些都不重要了，就算是又能怎样呢，主动去影响世界，比受世界影响要好得多。 积极主动可能是过去一年体会最深的一条准则：有人在犹犹豫豫有所顾虑时，积极主动的人早已明确自己想要什么，并为之开始努力争取了。 还有一条自己的变化就是消费观的转变，意识到“贵的东西唯一的缺点就是贵”，免费实际上并不免费。而且开始在意知识付费，可能是我已经成为了一棵傻乎乎绿油油的韭菜，一棵合格的且会自我洗脑的韭菜，等待险恶的资本家来收割。 不过还是要送给自己某位博主说过的一段话，提醒自己：“这个地球是由外向者主导的，内向者们不要变成徘徊在山腰里的犹豫者，那样终究会两不靠，一辈子一事无成。你们唯一的路就在山上，去山顶那座古寺里，静修属于自己的道，不必贪恋山下的红尘繁华，那暂时不属于你的，甚至很长时间都不会属于你的。外向者统御的世界，你们的天赋根本就不适合去八面玲珑，不适合和别人打成一片，也不适合立即得到满是笑脸的世界。修炼和打磨，需要很多时间、精力和意志，你们处在半山腰每天都羡慕山下的红尘，声色犬马，时间和精力都会悄悄溜走。” 关于学习这一年学习上最重要的事就是考研了，过程当然很煎熬，身体精神双重的那种，结果也并没有很好，大概率是去不成北京了。我的学习能力确实不是很强，有待提高，那么怎么去改变呢？备考的经历让我明白的很多（是不是有点晚，前几年干嘛去了？）写在这里，刻在自己的脑门上： 每天要强迫自己见一见陌生的、不理解的知识点。不能逃避和害怕，所有你现在觉得可以稍微放一放稍后再来处理的小问题，最后都会越积越复杂，成为鞋里磨脚的一粒沙，成为肉里的一根刺，最后虐得你遍体鳞伤。所以遇到问题就立即，马上，去解决它吧。 多交流。很多东西以为自己理解了，但其实并没有，检验自己掌握程度的标准是能不能教会别人，能不能说出来或者复现出来。所以与别人多交流就显得特别重要，不要害怕丢人或者不如别人，两种思考方式，两种理解方式的碰撞会带来一些意想不到的结果。一个人可以走得更快，但一群人可以走得更远。 计划与总结。这应该是面对所有事情都值得去做的。制定合适的计划，及时进行阶段总结，从最重要的任务开始，不要畏难。 专注。干一件事就要百分百投入，如果在走神或者学得很放松，那么你一定不会进步，学习一定是痛苦的，真正用心的思考一定是让人心力交瘁的。尤其注意要保持思维的连续性，不能考虑一个问题一半放下来又注意其他东西。 除了考研中学到的，还很有收获的就是这个博客，转眼都快一年了，从无到有，从几行代码到如今也算有鼻子有眼，就像自己的一个孩子，倾注了自己的心血。现在写的内容肯定很青涩很浅显，但这才第一年，只要我一直坚持更新，人生还很长，值得我去学习记录的东西绝对不会少。 关于生活和其他一些过去一年的生活给我的感觉就是被撕裂开的，各方面的撕裂。对自己来说，生活直接分成了两个部分，一半在家情绪低落，不知所措；另一半在学校每天奔波三点一线。和父母的关系随着自己慢慢长大，发生了一点微妙的变化，不知道怎么去有效沟通的双方相处起来总是问题不断。和室友的关系在一起醉了几场酒之后也更加铁了，所以还是那句话，不要太在意别人的看法，真心待人不会有错的。 关于运动，主要还是踢足球和跑步，只有疫情呆在家的那段时间做了一点室内自重运动，但并没有很好坚持下来。一年又一年，越来越不喜欢跑步，膝盖越跑越磨损，烦人的是，体重还每年都要涨一点，变得越来越肥。运动似乎陷入了一个舒适圈，自己擅长做的习惯做的永远在机械地重复，身体早已适应，而能锻炼自己的方式却很难坚持下来。新的一年不妨大胆去尝试一些新的运动（想去打拳击）。 关于看了哪些书。终于看完了第一遍《共产党宣言》；看完了一部畅销书《活着》；看完了余秋雨的《山河之书》，内容和《文化苦旅》有重合，只是前者增加了不少国内的篇目，而且增加的部分提到了我的家乡，讲到了贵池的傩戏；重新又回看了一部分《明朝那些事》；粗略地翻了几篇屠龙术——《毛泽东选集》；看完了一本很小众的书《布局天下》，主要讲的是中国古代军事和地理，里面很多内容都引自《读史方舆纪要》，所以有点古代兵书的味道，挺有意思；还有几本似乎并没有什么用的心理学成功学上的鸡汤。我认为看哪些书是件很主观的事，每个人都应当不一样，你是因为对某些方面感兴趣才去想要了解想要去看，硬着头皮强迫自己去看就失去了意义，而且所谓的书单都是不可复制的。 受疫情影响加上要准备考研，所以这一年心心念念的韶山没去成，球赛也没看成，只在省内附近随便转了转，一个人跑来跑去每次最快乐的时候竟是坐在车上什么都不想，放空自己听歌的时候。很多情况下，能给你留下回忆的不是那种买门票才能进去的地方，而是路程中不经意的某幅画面和来自陌生人的温暖。 疫情在家的时候，看了一些乱七八糟的东西，对建国后的历史有了更深的了解，变得左了起来。如果用一个词来形容自己的感受，那就是——震惊，震惊到直接把过去十几年建立起来的历史观打碎，也深刻地体会到“历史是一个任人打扮的小姑娘”这句话的含义，深刻体会到政治的复杂和残酷，那是老谋深算的白胡子们的游戏，空有几腔热血的年轻人还是再被毒打几十年再考虑涉足吧。无论怎样，追求正义、良善，相信人性中的美好一面，这也许是社会正常运转螺旋上升的精神支撑。 写在最后我们每个人不是先知，也根本没法成为先知，无法精准躲过一个个黑坑，只能通过人生不断地毒打，来逐渐改变、修正航行的方向。尘归尘，土归土，曾经的过往，痛苦也好，快乐也罢，都变成手心绚烂的烟火，向着我们头顶的漫天银河轻轻扬了吧，2020都过去了，可不能让未来的美好的人和事等待太久。2021再加加油！","categories":[{"name":"复盘","slug":"复盘","permalink":"https://wanghaoranv.github.io/categories/%E5%A4%8D%E7%9B%98/"}],"tags":[{"name":"年终总结","slug":"年终总结","permalink":"https://wanghaoranv.github.io/tags/%E5%B9%B4%E7%BB%88%E6%80%BB%E7%BB%93/"}]},{"title":"读书笔记:《精力管理》","slug":"读书笔记-《精力管理》","date":"2020-07-09T09:07:58.000Z","updated":"2021-01-13T14:57:01.145Z","comments":true,"path":"2020/07/09/读书笔记-《精力管理》/","link":"","permalink":"https://wanghaoranv.github.io/2020/07/09/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0-%E3%80%8A%E7%B2%BE%E5%8A%9B%E7%AE%A1%E7%90%86%E3%80%8B/","excerpt":"本书从精力角度而不是从时间角度阐述有关高效的观点。毋容置疑，每个人的精力都是有限的，学会管理与合理安排自己的精力，是一生都要学习的课题。","text":"本书从精力角度而不是从时间角度阐述有关高效的观点。毋容置疑，每个人的精力都是有限的，学会管理与合理安排自己的精力，是一生都要学习的课题。 如何全情投入第一章第二章 第三章 精力的四个维度第四章：体能精力 第五章：情感精力 第六章：思维精力 第七章：意志精力 精力管理训练明确目标 正视现实 付诸行动","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"https://wanghaoranv.github.io/categories/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"https://wanghaoranv.github.io/tags/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}]},{"title":"读书笔记:《刻意练习》","slug":"读书笔记-《刻意练习》","date":"2020-06-27T04:43:48.000Z","updated":"2021-01-12T15:46:49.526Z","comments":true,"path":"2020/06/27/读书笔记-《刻意练习》/","link":"","permalink":"https://wanghaoranv.github.io/2020/06/27/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0-%E3%80%8A%E5%88%BB%E6%84%8F%E7%BB%83%E4%B9%A0%E3%80%8B/","excerpt":"","text":"前言 第一章：有目的的练习 第二章：大脑的适应能力 第三章：心理表征 第四章：黄金标准 第五章：在工作中运用刻意练习 第六章：在生活中运用刻意练习 第七章：成为杰出人物的路线","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"https://wanghaoranv.github.io/categories/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"https://wanghaoranv.github.io/tags/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}]},{"title":"一文说懂梯度散度旋度","slug":"一文说懂梯度散度旋度","date":"2020-06-11T02:05:41.000Z","updated":"2020-06-11T02:05:41.406Z","comments":true,"path":"2020/06/11/一文说懂梯度散度旋度/","link":"","permalink":"https://wanghaoranv.github.io/2020/06/11/%E4%B8%80%E6%96%87%E8%AF%B4%E6%87%82%E6%A2%AF%E5%BA%A6%E6%95%A3%E5%BA%A6%E6%97%8B%E5%BA%A6/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"HTML基础(二)","slug":"HTML基础(二)","date":"2020-04-02T15:30:54.000Z","updated":"2021-01-07T11:49:11.547Z","comments":true,"path":"2020/04/02/HTML基础(二)/","link":"","permalink":"https://wanghaoranv.github.io/2020/04/02/HTML%E5%9F%BA%E7%A1%80(%E4%BA%8C)/","excerpt":"各种功能不同的标签是HTML语句的基石","text":"各种功能不同的标签是HTML语句的基石 标题标签HTML提供了6个等级的标签：&lt;h1&gt;&lt;/h1&gt;到&lt;h6&gt;1级向6级依次字体减小，粗体减弱 段落和标签分段&lt;p&gt; &lt;/p&gt;，段落之间有较大缝隙强制换行&lt;br/&gt;，单标签 文本格式化标签 加粗：&lt;strong&gt; &lt;/strong&gt;或&lt;b&gt; &lt;/b&gt; 倾斜：&lt;em&gt; &lt;/em&gt;或&lt;i&gt; &lt;/i&gt; 删除线：&lt;del&gt; &lt;/del&gt;或&lt;s&gt; &lt;/s&gt; 下划线：&lt;ins&gt; &lt;/ins&gt;或&lt;u&gt; &lt;/u&gt;更推荐使用顺序考前的标签 和标签这两个标签是没有语义的，是一个盒子，用来装内容division：分割span：跨度 &lt;div&gt;:用来布局，一个人独占一行，看作是一个大盒子&lt;span&gt;:也用来布局，但是一行可以有多个&lt;span&gt;包含的内容，小盒子 图像标签&lt;img&gt;用来定义图像，单标签属性有： scr：必须要带，src= “url图像地址”，&lt;img src=&quot;&quot;/&gt; alt：替换文本，图片不能显示时，用文字替换&lt;img alt=&quot;&quot;/&gt; title:提示文本，鼠标放在文字上时显示的文字&lt;img title=&quot;&quot;/&gt; width:给图像设置宽度，&lt;img width=&quot;&quot;/&gt; height：给图像设置高度，&lt;img height=&quot;&quot;/&gt; border：给图像设置边框，&lt;img border=&quot;&quot;/&gt;，边框的设置通常使用css图像标签的属性一定要写在img后面，采用键值对的方式，可以顺序调换 路径 目录文件夹，就是普通的文件夹，包含所有需要的文件资源和素材 根目录：打开目录文件夹的第一层就是根目录","categories":[{"name":"前端基础","slug":"前端基础","permalink":"https://wanghaoranv.github.io/categories/%E5%89%8D%E7%AB%AF%E5%9F%BA%E7%A1%80/"}],"tags":[{"name":"HTML","slug":"HTML","permalink":"https://wanghaoranv.github.io/tags/HTML/"},{"name":"前端","slug":"前端","permalink":"https://wanghaoranv.github.io/tags/%E5%89%8D%E7%AB%AF/"}]},{"title":"HTML基础(一)","slug":"HTML基础-一","date":"2020-03-26T06:32:48.000Z","updated":"2021-01-07T11:49:21.245Z","comments":true,"path":"2020/03/26/HTML基础-一/","link":"","permalink":"https://wanghaoranv.github.io/2020/03/26/HTML%E5%9F%BA%E7%A1%80-%E4%B8%80/","excerpt":"HTML就是超文本标记语言Hypertext Text Marked Language，可以将文本、图片、声音、动画等不同类型的信息整合到一起，在网页上显示出来，还可以从一个文件跳到另一个文件。严格说HTML并不是一门语言，而是一些能够让浏览器看得懂的标记。这是制作一个网页用到的最基础的技术。","text":"HTML就是超文本标记语言Hypertext Text Marked Language，可以将文本、图片、声音、动画等不同类型的信息整合到一起，在网页上显示出来，还可以从一个文件跳到另一个文件。严格说HTML并不是一门语言，而是一些能够让浏览器看得懂的标记。这是制作一个网页用到的最基础的技术。 万维网和HTML首先介绍万维网：WWW (World Wide Web）：百度如是说：是基于客户机/服务器方式的信息发现技术和超文本技术的综合。万维网与因特网与互联网还是有一些区别的： 万维网：是一个系统，由一些资源、标签、传输协议构成的系统。用户通过唯一的标签选择资源，然后通过协议在浏览器上渲染显示。打个比方，类似网购过程：资源（文件）就像是商品，是我们用户要买的东西；每个商品都有一个唯一对应的标签牌链接（URL）；决定购买商品时，寻找标签牌链接，然后商品开始快递，从运输到拿到的过程就好比是使用超文本传输协议的过程 因特网（Internet):由美国军方研发然后逐渐发展民用，将全世界所有计算机连接起来。概念比万维网更底层一些，通过最基本的一些数据包传递信息，实现连接。因特网包括万维网，也包括其他一些服务，如：电子邮件、IP电话等 互联网（internet）:有广义和狭义之分。广义上，能相互之间通信的设备组成的网络就叫互联网；狭义上互联网与因特网含义类似。但注意，也有不是因特网的互联网。 服务器通过超文本标记语言(HTML)把信息组织成为图文并茂的超文本，利用链接从一个站点跳到另个站点。这样一来彻底摆脱了以前查询工具只能按特定路径一步步地查找信息的限制 什么是超文本文件？超文本文件是指包含有链接关系和多媒体对象的文件。 万维网分为三个基本组成部分： URL（ Universal Resource Locators ）：统一资源定位器，相当于网页的一个唯一ID，提供在web上进入目标资源的统一方法和路径 HTTP ( Hypertext Transfer Protocol )：一种在网络上传输数据的协议，专门用于以超文本或超媒体的形式提供的信息 HTML ( Hypertext Text Marked Language ):一种文本类、依靠解释的方式执行的超文本标记语言，主要用作编写网页；可以直接用任何文本编辑器打开，查看HTML源码，无需编译直接解释执行 HTML文件的基本结构&lt;html&gt; &lt;head&gt; &lt;title&gt;文件标题&lt;/title&gt; &lt;/head&gt; &lt;body&gt; 文件正文 &lt;/body&gt; &lt;/html&gt;HTML标签一个HTML文件由许多个标签和元素组成。 标签：用来规定元素属性和位置，小尖括号，可分为，单独标签：相应位置插入元素（如 &lt;br&gt;换行符）和成对标签控制之间的元素（如&lt;title&gt;&lt;/title&gt;） 元素：通常被一对标签包围；定义：当用一组HTML标签将一段文字包含在中间时，这段文字与包含文字的HTML标签被称为一个元素(从开始标签到结束标签的所有)&lt;元素名&gt;要控制的元素&lt;/元素名&gt;相当于大元素不断嵌套包含小元素，如&lt;html&gt;&lt;/html&gt;，是最外层的元素，里面又嵌套了很多其他元素 标签之间的关系有：嵌套和并列 一些细节： 元素名不分大小写； 标签中写的元素名可以设置一些（任意？）属性值，放在头标签，如&lt;元素名 属性 1=”值1” 属性 2=”值2”&gt;，双引号可省略 编写时，空格回车在源代码起不了作用，为了便于辨识，一个标签一次换行 注释：&lt;!-- 注释 --！&gt; 基本结构标签 &lt;html&gt; &lt;/html&gt;:HTML标签，根标签，页面中最大的标签 &lt;head&gt; &lt;/head&gt;:头部标签，当中必须包含title标签 &lt;title&gt; &lt;/title&gt;:标题标签，显示网页的名称， &lt;body&gt; &lt;/body&gt;:主体标签，包含页面的所有内容 Web标准网页开发时，要遵循Web标准，分为三个部分： 结构【身体】：用于对网页元素进行整理和分类，主要是HTML 表现【衣服】：用于设置网页元素的版式、颜色、大小等外观样式，主要是CSS 行为【动作】：用于网页模型的定义以及交互的编写，主要是JavaScript Web标准提出的最佳体验方案：结构、样式、行为相互分离；即结构写道HTML文件中，表现写到CSS文件中，行为写到JavaScript文件中。打个比方，结构相当于一个人的身体，没有装饰；而表现就是穿了衣服；行为就是让一动不动的躯体有了各种动作，实现更多功能。","categories":[{"name":"前端基础","slug":"前端基础","permalink":"https://wanghaoranv.github.io/categories/%E5%89%8D%E7%AB%AF%E5%9F%BA%E7%A1%80/"}],"tags":[{"name":"HTML","slug":"HTML","permalink":"https://wanghaoranv.github.io/tags/HTML/"},{"name":"前端","slug":"前端","permalink":"https://wanghaoranv.github.io/tags/%E5%89%8D%E7%AB%AF/"}]},{"title":"Java基础（三）","slug":"Java基础（三）","date":"2020-03-20T12:34:35.000Z","updated":"2021-01-15T12:37:23.231Z","comments":true,"path":"2020/03/20/Java基础（三）/","link":"","permalink":"https://wanghaoranv.github.io/2020/03/20/Java%E5%9F%BA%E7%A1%80%EF%BC%88%E4%B8%89%EF%BC%89/","excerpt":"","text":"","categories":[{"name":"Java系列","slug":"Java系列","permalink":"https://wanghaoranv.github.io/categories/Java%E7%B3%BB%E5%88%97/"}],"tags":[{"name":"Java基础","slug":"Java基础","permalink":"https://wanghaoranv.github.io/tags/Java%E5%9F%BA%E7%A1%80/"}]},{"title":"Java基础（二）","slug":"Java基础（二）","date":"2020-03-20T12:24:26.000Z","updated":"2021-01-16T13:07:48.387Z","comments":true,"path":"2020/03/20/Java基础（二）/","link":"","permalink":"https://wanghaoranv.github.io/2020/03/20/Java%E5%9F%BA%E7%A1%80%EF%BC%88%E4%BA%8C%EF%BC%89/","excerpt":"","text":"","categories":[{"name":"Java系列","slug":"Java系列","permalink":"https://wanghaoranv.github.io/categories/Java%E7%B3%BB%E5%88%97/"}],"tags":[{"name":"Java基础","slug":"Java基础","permalink":"https://wanghaoranv.github.io/tags/Java%E5%9F%BA%E7%A1%80/"}]},{"title":"Java基础(一)","slug":"Java基础(一)","date":"2020-03-19T15:30:15.000Z","updated":"2020-06-04T15:12:54.143Z","comments":true,"path":"2020/03/19/Java基础(一)/","link":"","permalink":"https://wanghaoranv.github.io/2020/03/19/Java%E5%9F%BA%E7%A1%80(%E4%B8%80)/","excerpt":"此系列用作学习Java的笔记，第一篇从最简单的Java知识讲起","text":"此系列用作学习Java的笔记，第一篇从最简单的Java知识讲起 概述软件：一系列按照特定顺序组织的计算机数据和指令的集合，人与计算机之间更好交互，我们想做什么，计算机必须听懂我们，采用的语言就是计算机语言（很多种，编程语言） 交互方式有： 图形化 ：Windows，视图，鼠标点击的方式 命令行方式：要记住很多指令 常见的DOS命令有： md 创建文件夹 cd 进入文件夹，前进一级 cd.. 后退一级 dir 列出当前目录下文件及文件夹 rd 删除目录，删除时必须为空 cd/ 返回根目录 del 删除文件，后面跟文件名，dos上不走回收站，*代表删所有文件，而 *.txt 则只选择txt文件 set classpath= 后加路径，表示在此路径下运行，设置环境变量；后不加，表示清空环境变量 跨平台性简单来说，通过Java语言编写的应用程序在不同的操作系统上都能运行，具有良好的移植性在不同操作系统上，只要安装虚拟机 JVM , 就能跨平台运行，虚拟机也分版本针对不同平台windows使用C和C++，系统内也有针对这两种语言的虚拟机，所以对他们具有良好的适应性 文本运行javac 文本文件名.java ：产生字节码文件.class java 产生的字节码文件名 ：运行 -类名Class前可以不加public（修饰符，提升权限），只是加了以后，文件名一定要跟类名一致 第一个程序的解析public //修饰字class//关键字：被Java语言定义的特殊的，只能小写，定义类， Hello World //类名，起一些有意义的词，代表类；类名通常（非必须）用单词构成单词首字母通常大写，多个单词首字母也通常大写 大括号定义类的区间 { public static void main(String[] args) /* 主函数，程序从这里开始运行，固定格式，保证类的独立运行，被虚拟机调用 /* { System.out.println(&quot;HelloWorld&quot;); // 输出打印语句，分号必须要带上，编译时期检查语法 }} 一个源文件可以写进两个类，生成两个字节码文件，但只能从具有主函数的类开始运行 类里不是必须写主函数，需要类运行就写主函数，一个文件多个类可以写进多个主函数，但一个类只能写一个主函数，即程序入口。 多行注释：常在一些方法前 /* 这是第一行注释 这是第二行注释 */ 保存在bin文件夹中，Javadoc.exe ，会提取出所有的注释，相当于一个说明书 文档注释，通常在文件开头，Java特有的注释 /** 一些信息 /* 注释也可以当作断点，用来调试程序；单行注释，多行 注释中都可以添加单行注释，但是注意，多行注释中不能嵌套多行注释 写代码先写注释，思想，然后用编程语言表达出 /* 需求:。。。。 思路：1.2.3. 步骤：1.定义的类2.3.4.5.。。。。","categories":[{"name":"Java系列","slug":"Java系列","permalink":"https://wanghaoranv.github.io/categories/Java%E7%B3%BB%E5%88%97/"}],"tags":[{"name":"Java基础","slug":"Java基础","permalink":"https://wanghaoranv.github.io/tags/Java%E5%9F%BA%E7%A1%80/"}]},{"title":"足球复盘：切尔西vs拜仁","slug":"19-20欧冠1-8切尔西vs拜仁","date":"2020-02-26T06:07:12.000Z","updated":"2021-01-04T08:05:25.316Z","comments":true,"path":"2020/02/26/19-20欧冠1-8切尔西vs拜仁/","link":"","permalink":"https://wanghaoranv.github.io/2020/02/26/19-20%E6%AC%A7%E5%86%A01-8%E5%88%87%E5%B0%94%E8%A5%BFvs%E6%8B%9C%E4%BB%81/","excerpt":"19-20赛季欧冠八分之一决赛，切尔西主场对阵拜仁慕尼黑，最终比分 0 ：3","text":"19-20赛季欧冠八分之一决赛，切尔西主场对阵拜仁慕尼黑，最终比分 0 ：3 第一次公开尝试足球复盘系列，坦白讲，足球战术十分复杂，从很多方面都可以落笔展开，宏观的战术布置、阵型轮转变化，微观的球员临场处理、相互配合……鉴于水平有限，观看比赛又往往局限于自己喜爱的球队，加上分析需要大量的图片或动图，只能粗略地以某一队为主写一点，不太详细，当中肯定有不准确的地方。就当作爱好来看吧，下面开始第一篇。 前沿北京时间2020年2月26日，欧冠十六进八决赛，拜仁慕尼黑客场来到伦敦斯坦福桥挑战切尔西，前者在换帅后有一波强势反弹，暂时登上了德甲头名，赛前信心十足，被广泛看好；东道主切尔西由于转会禁令，大幅启用年轻球员，整个赛季都不太稳定，只不过上一场比赛刚刚击败了穆尼里奥率领的热刺。 关于两队的伤病情况，都不太乐观，切尔西损失了中场核心坎特，这对他们的整体实力影响较大，还有奥多伊、普利希奇因伤不能出场；拜仁慕尼黑的伤病问题一直很严重，过去很多重要比赛都一定程度受伤病影响，这场比赛，聚勒、佩里西奇、卢卡斯、哈维马丁内斯皆因伤缺阵，后防线采用拼凑的组合。 首发阵容 首发， 图源：刘强专栏 切尔西摆出了3-4-3，三后卫阵型，与孔蒂时代有些类似，具体因为不怎么看切尔西，所以本文以拜仁为主进行分析。 拜仁慕尼黑则采用了“以我为主”的战术选择——熟悉的、使用频率高的4-2-3-1阵型，这套打法在多位主帅的打磨下显然比较成熟，球员也更能适应，更能发挥。 打法浅析前面说到，拜仁使用4-2-3-1，其发挥攻击力关键在于前场进攻三人组与顶在最前面的大中锋莱万多夫斯基来回穿插配合，这位全能的德甲小钢炮发挥了远超于普通中锋的战术作用，几位前场攻击手在他的接应下踢得都很舒服。右边锋科曼刚刚伤愈，可以明显看出这场比赛他的状态不佳，有点十分想表现却力不从心的感觉，不过他的速度依然是对方十分忌惮的进攻武器。左边格纳布里倒是状态不错，取得了两粒进球，在他熟悉的老地方，这位从伦敦走出来的边锋正以肉眼可见的速度成长。其实说来奇怪，这两位边锋原本都踢的是相反的一边，记不清从什么时候开始换位，从几场比赛来看效果还不错。此外，非传统前腰穆勒在他最喜欢的位置上，跑位，接应，有着“球混子”属性的他这场比赛活动范围很大，与莱万交替换位，与两边换位，回到中场压迫……起到了前场润滑剂的效果。 中间使用了蒂亚戈和基米希两位技术型中场，也常常被形容为“文官中场”，含义不难理解，与武官相对应，技术型中场往往小技术出色，具有一定的摆脱调度能力，而强硬的身体、拦截等“武官”中场的特点则相对不具备。这两位技术型后腰：蒂亚戈曾自己在采访中说过，更喜欢10号位的工作，即进攻的组织核心，偏前腰偏攻击，而不是防守拦截；另一位基米希，原本踢右边后卫的时候就攻强于守，不想安分呆在后场，直接踢成了右边翼位，现在改到自己想尝试的后腰位。所以综上，拜仁的两位后腰都长于进攻，少了一点硬度，少了一点传统后腰的防守力，而且这两位的身高都不高，后场的高球保护更是一个难点。 为了避免可能出现的防守问题，解决方案也很简单——全队压迫，从几位进攻手开始，防守时莱万与穆勒总有一位回撤干扰，另一位就默契的顶到前面，中场及后场球员更不用说，往往在丢球的时刻立即开始反抢，从赛后数据来看，进攻手格纳布里抢断竟达到六次，全场最高，蒂亚戈全场拦截也达到了五次。中后卫阿拉巴的运动能力很强，这场比赛常常能看到他向前防守，甚至带球向前，而另一位中后卫博阿滕位置相对靠后，不再贸然向前，防止因为自己速度慢被打身后，起着站桩防高球争顶的作用。此前他一直因为年龄增长状态下滑而饱受批评，说实话我个人有点于心不忍，一路辉煌一路坎坷走过来，给这位成长在慕尼黑的功勋一点时间吧。往往年轻时依靠身体的中后卫，在30岁过后大多逃不掉退步的后果。再看看两个边后卫，帕瓦尔表现中规中矩，助攻传中都有点勉强，另一位戴维斯则让人眼前一亮，身体素质优秀，速度快，能助攻，几次防守就算有点失位，最后也能依靠速度追上弥补，进攻更不用说，前锋出身有突破，此役也贡献了一粒一条龙助攻。况且他才十九岁，前途无限，有着年轻人初生牛犊不怕虎的劲头，只是有点担心这种踢法以后会带来伤病…… 赛况45+1：蒂亚戈黄牌 49：基米希、若日尼奥黄牌 51：格纳布里进球、莱万助攻 54：格纳布里进球、莱万助攻 61：亚伯拉罕换吉鲁，威廉换巴克利 66：库蒂尼奥换科曼 73：佩德罗换阿斯皮利奎塔 76：莱万进球、戴维斯助攻 83：马科斯阿隆索红牌 85：托利索换格纳布里 90：格雷茨卡换蒂亚戈 图片报赛后评分 总结此役，在拜仁后场强大的后场“发牌”能力下，切尔西的机会并不多，如果说上半场两队互有攻守，那么下半场在拜仁第一粒进球后局势变得很明朗。拜仁在进攻端充分利用了边中转移的策略，但赢球更重要的原因还是两队存在一定的实力差距。次回合只要稳扎稳打，晋级可期。 不过，赛后莱万被报道骨折休战至少四周，科曼赛程中也伤退，给本该值得庆祝的胜利蒙上了一层阴影。","categories":[{"name":"复盘","slug":"复盘","permalink":"https://wanghaoranv.github.io/categories/%E5%A4%8D%E7%9B%98/"}],"tags":[{"name":"足球复盘","slug":"足球复盘","permalink":"https://wanghaoranv.github.io/tags/%E8%B6%B3%E7%90%83%E5%A4%8D%E7%9B%98/"}]},{"title":"Hexo+Github搭建博客简易指南","slug":"Hexo-Github搭建博客简易指南","date":"2020-02-19T12:43:03.000Z","updated":"2020-06-07T08:03:03.183Z","comments":true,"path":"2020/02/19/Hexo-Github搭建博客简易指南/","link":"","permalink":"https://wanghaoranv.github.io/2020/02/19/Hexo-Github%E6%90%AD%E5%BB%BA%E5%8D%9A%E5%AE%A2%E7%AE%80%E6%98%93%E6%8C%87%E5%8D%97/","excerpt":"与其说是指南，不如说是自己搭建过程的总结，以及遇到问题的记录","text":"与其说是指南，不如说是自己搭建过程的总结，以及遇到问题的记录，因为这个博客采用了比较省事的搭建方式，自己也实在没有能力出一个完整的教程。 要想搭建一个博客，实际上就是一个网站，内容界面可以自己开发设计，重要的是，要获取个人独有的域名和提供响应服务器。因此，博客搭建大致分成两个部分，其一：在本地构建好网页，设计好界面；其二：将个人域名与网页绑定，推到远端服务器，让别人可以从互联网上访问。 网页网页一般可分为两种——静态网页和动态网页，静态网页并不是指没有动画的网页，而是指网页的所有内容文件直接存储保存在服务器上，每次用户发出访问请求，服务器无需编译，直接将文件内容加载到浏览器上显示出来，动态网页则不然，动态网页收到用户请求后，服务器上会运行程序，调用、生成一些内容（数据、页面文件……），然后返回给用户显示出结果，网页会根据用户的要求和选择而动态地改变和响应，不同人，不同时间访问，返回结果都不一定相同。 举个例子，本博客就是一个静态网页，不管谁访问都显示相同的内容，每次修改，都是直接在文件上改变，每次修改都需要重新发布（相当于覆盖）；而像学校的教务系统，微博等，不同用户、不同时候访问，其结果都不尽相同，是典型的动态网页，服务器端的程序会自动运行并更换内容（相当于调整）。 因此，静态网页把主要任务都交给用户端的浏览器加载，而动态网页对远端服务器的处理能力要求更高，两者最主要的区别是，是否在服务器上有程序运行。只有动态服务器才能使用数据库，因此能实现功能更多，如：用户注册，登录，订单管理等等，运用也更广泛，当然，动态静态并非互不相容，可以混合使用。还有，静态网页每个网页都有一个固定的URL,且网页URL以.htm、.html、.shtml等常见形式为后缀，不含有“？”。 服务器与域名回到博客的创建，我们需要一个服务器，服务器与我们平时使用的PC并无太大差别，只是更强调稳定性和性能，可以选择用一台闲置电脑，不过要保持一直开机，随时供人访问。还可以选择花钱购买云主机，像阿里云 、腾讯云 等，都提供了这样的服务。本博选择了一种免费的方式，就是利用代码协作开发平台，常见的有Github、码云Gitee等，这些平台就是代码仓库，人们将代码上传分享，可以将服务器托管在这些平台上。 除了服务器我们还需要一个没注册过的域名，当然每个人都希望自己的域名有个性一点，获取方式很简单，就是花钱买，阿里云腾讯云也提供了这样的服务，也还有一种免费的方式，和前面一样，这些平台会提供给你一个域名，可以部分自己取，总之，这些平台还算稳定，也免费，对于搭建个人博客，足够使用。本博客托管在Github上，服务器在国外，国内访问速度会有影响，其他的一些国内平台速度会快一些。 网页框架搭建构建网页设计界面的过程，也就是常说的前端工程师完成的部分，本博客直接使用网上别人已经开发好的框架和主题。 常见的框架有： WordPress：动态框架，基于PHP语言 Heox：静态框架，基于JavaScript语言 Jekyll：静态框架，基于Ruby语言 Hugo：静态框架，基于Go语言 本博客采用Hexo框架，具体步骤官方网站上写得比较清楚Hexo官方文档，在这我就大致复盘一下，主要记录我遇到的问题 安装Hexo首先需要安装一些环境：Git:直接在官网下载，如果下载速度极慢，需要用到淘宝镜像源，具体地址官方文档有,上面已给出链接。Git到底是什么？我也没能太理解，似乎是一个分布式版本系统，可以控制代码版本，相当于作为仓库保存修改前修改后的内容。听职场程序员说，Git在工作中用处很大，很重要。下图是Git工作原理: 注：Workspace:工作区; Index:暂存区; Repository:本地仓库; Remote:远程仓库,图源知乎 Node.js：直接在官网下载，如果安装速度极慢，同样需要淘宝镜像源。Node.js 是Javascript（开发Web页面的脚本语言）的运行环境，是一个前端的框架，能够让JavaScript在服务端运行。 以上两个工具安装完成后，正式开始安装Hexo，具体步骤指令可参照官方文档。安装完成后，可以使用 hexo s指令，利用本地服务器4000端口，测试加载情况，这时应看到初始的博客，后续的主题使用配置，可以在官网的主题页里进行选择。 Github众所周知Github是一款全球流行的同性交友软件，使用前需要绑定邮箱进行注册。注意，你注册的用户名，以后会用作域名的一部分，不要太随意就行。注册完成后新建一个仓库，仓库名一定要以：你的用户名.github.io 命名，否则不能成功，这就是你博客的域名。新建仓库后可以在Setting里设置发布，这时，你在网页上输入域名，就可以看到初始的页面。如果有能力可以在这个仓库里写进代码，自己设计创建网页，但这里我就导入前面部署好的Hexo框架。 配置SSH密钥两部分都准备好了之后，我们还要配置SSH密钥，具体含义我不太理解，这里直接放出网上找的资料： SSH是建立在应用层和传输层基础上的安全协议，其目的是专为远程登录会话和其他网络服务提供安全性的保障，用过SSH远程登录的人都比较熟悉，可以认为SSH是一种安全的Shell。 SSH登录是需要用户名和密码的，要实现无密码登录，就需要创建SSH 密钥（ssh key），SSH 密钥可以认为是和另一台电脑通信时的唯一的识别证，SSH 密钥对可以让我们方便的登录到 SSH 服务器，而无需输入密码——来源见文末[01] 使用配置的命令必须要在Git Bash中执行，首先执行ls -l ~/.ssh，检查密钥是否存在，然后执行ssh-keygen -t rsa -C &quot;your_email@example.com&quot;生成新的密钥，这里的邮箱是你注册Github时绑定的，运行过程要敲三次回车，回车实际上就是将密码之类的设为空。这时你的电脑会生成.ssh文件，可以到/.ssh目录（一般在C盘用户目录下，如果找不到可以在C盘直接搜索）下查看相关文件，一般来说ssh密钥会包含id_rsa和id_rsa.pub两个文件，分别表示生成的私钥和公钥。然后用记事本打开公钥id_rsa.pub，将所有内容，复制到Github &gt;Setting &gt;SSH and GPG keys 里，title随意取，key为刚复制的公钥，添加密钥。当中可能有一步要在Git Bash上绑定用户名和邮箱，具体情况视报错提示而定。 部署最后的部署要使用hexo-deployer-git插件，具体步骤和指令Hexo官方文档有，一键部署。之后同样根据文档修改配置就大功告成了。使用的主题样式可以自由选择，很多功能还要自己慢慢摸索，以后也可以学习前端的知识修改别人的主题，自己设计。 参考资料[01]. https://www.jianshu.com/p/7aba9b127cb8[02]. https://www.jianshu.com/p/c9295bacd98b[03]. Hexo官方文档[04]. CSDN[05]. 百度百科[06]. B站_CodeSheep[07]. B站_hujun_cn","categories":[{"name":"指南","slug":"指南","permalink":"https://wanghaoranv.github.io/categories/%E6%8C%87%E5%8D%97/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"https://wanghaoranv.github.io/tags/Hexo/"},{"name":"网页","slug":"网页","permalink":"https://wanghaoranv.github.io/tags/%E7%BD%91%E9%A1%B5/"},{"name":"博客搭建","slug":"博客搭建","permalink":"https://wanghaoranv.github.io/tags/%E5%8D%9A%E5%AE%A2%E6%90%AD%E5%BB%BA/"}]},{"title":"写在前面","slug":"写在前面","date":"2020-02-17T16:00:00.000Z","updated":"2021-01-17T06:15:01.409Z","comments":true,"path":"2020/02/18/写在前面/","link":"","permalink":"https://wanghaoranv.github.io/2020/02/18/%E5%86%99%E5%9C%A8%E5%89%8D%E9%9D%A2/","excerpt":"","text":"写在博客创建之初就像每本书都有它的前言，自己的博客也在创建之初写下一些话吧。很久前就想创建博客，去年有幸接触了一群已经身在职场的程序员，第一次看到别人精致、专业的博客，更加坚定了自己搭建的想法。说实话，他们对生活和学习的态度真的有激励到我。 搭建的过程比较曲折，问题不断，好在最近时间充裕，慢慢修改，最终还是有了结果。其实回头来看，创建的过程远比现在写内容有意思的多，那种有反馈一步一步解决问题的感觉很舒服。对于以后希望自己能一直坚持更新，虽然未来也不一定能从事代码有关的工作，但生活总是自己的，值得永远学习探索。平日里虽也时不时写点东西，但文笔依旧很烂，只能追求每一篇博文尽量表达清楚。 我深知博客是别人看的，有价值的内容是重中之重，无奈目前才疏学浅，就暂且把这儿当作学习知识的踩坑记录吧。另外，本博客暂时是托管在Github上，服务器在国外，国内访问速度比较慢，还经常被墙，未来可能会找机会购买域名和服务器，进行迁移。 最后，真的很喜欢当年明月先生《明朝那些事儿》结尾的那段话，放在这里： 此前，我讲过很多东西，很多兴衰起落、很多王侯将相、很多无奈更替、很多风云变幻，但这件东西，我个人认为，是最重要的。因为我要告诉你，所谓千秋霸业，万古流芳，以及一切的一切，只是粪土。先变成粪，再变成土。现在你不明白，将来你会明白，将来不明白，就再等将来，如果一辈子都不明白，也行。而最后讲述的这件东西，它超越上述的一切，至少在我看来。但这件东西，我想了很久，也无法用准确的语言，或是词句来表达，用最欠揍的话说，是只可意会，不可言传。然而我终究是不欠揍的，在遍阅群书，却无从开口之后，我终于从一本不起眼，且无甚价值的读物上，找到了这句适合的话。这是一本台历，一本放在我面前，不知过了多久，却从未翻过，早已过期的台历。我知道，是上天把这本台历放在了我的桌前，它看着几年来我每天的努力，始终的坚持，它静静地，耐心地等待着终结。它等待着，在即将结束的那一天，我将翻开这本陪伴我始终，却始终未曾翻开的台历，在上面，有着最后的答案。我翻开了它，在这本台历上，写着一句连名人是谁都没说明白的名人名言。是的，这就是我想说的，这就是我想通过徐霞客所表达的，足以藐视所有王侯将相，最完美的结束语：成功只有一个——按照自己的方式，去度过人生。 祝愿我能用这短暂的一生，去贴一贴这个世界的嶙峋一角。 ————2020.2.18 于青阳","categories":[{"name":"杂谈","slug":"杂谈","permalink":"https://wanghaoranv.github.io/categories/%E6%9D%82%E8%B0%88/"}],"tags":[{"name":"写在前面","slug":"写在前面","permalink":"https://wanghaoranv.github.io/tags/%E5%86%99%E5%9C%A8%E5%89%8D%E9%9D%A2/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-02-15T16:00:00.000Z","updated":"2020-02-18T09:03:32.452Z","comments":true,"path":"2020/02/16/hello-world/","link":"","permalink":"https://wanghaoranv.github.io/2020/02/16/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. 你好，欢迎来到我的博客Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}