{"meta":{"title":"汪浩然的博客","subtitle":null,"description":"","author":"wanghaoran","url":"https://wanghaoranv.github.io","root":"/"},"pages":[{"title":"About","date":"2020-02-17T12:22:25.000Z","updated":"2020-03-01T07:59:49.114Z","comments":true,"path":"about/index.html","permalink":"https://wanghaoranv.github.io/about/index.html","excerpt":"","text":"About me你好，我叫汪浩然，目前仍是一名学生，专业通信工程平时热爱足球，有时间会看看书，对很多方面都比较感兴趣，但通常不能很深入了解学习这是我的缺点，正在逐渐改变 Blog关于搭建这个博客的初衷，是让自己学会总结并乐于分享交流，如果顺带能鞭策自己，再好不过日后的写作内容，作为技术型博客，尽量避免主观心情，以计算机通信领域为主，可能会包含一些足球比赛复盘/读书笔记/游记心得。由于知识水平实在有限，正在努力学习，读者发现错误望指正。只是，接下来的一年，时间会很紧张，希望自己能好好把握 目前博客的功能内容还很简陋，很多东西正在慢慢摸索完善…… 在偌大的世界中，如果你有缘看到了我写的这些话，不妨交个朋友吧 ↓"}],"posts":[{"title":"HTML基础(一)","slug":"HTML基础-一","date":"2020-03-26T06:32:48.000Z","updated":"2020-04-04T15:21:54.102Z","comments":true,"path":"2020/03/26/HTML基础-一/","link":"","permalink":"https://wanghaoranv.github.io/2020/03/26/HTML%E5%9F%BA%E7%A1%80-%E4%B8%80/","excerpt":"此系列用作学习HTML时的笔记","text":"此系列用作学习HTML时的笔记 万维网和HTML首先介绍万维网：WWW (World Wide Web）：是基于客户机/服务器方式的信息发现技术和超文本技术的综合。 服务器通过超文本标记语言(HTML)把信息组织成为图文并茂的超文本，利用链接从一个站点跳到另个站点。这样一来彻底摆脱了以前查询工具只能按特定路径一步步地查找信息的限制 什么是超文本文件？超文本文件是指包含有链接关系和多媒体对象的文件。 万维网分为三个基本组成部分： URL（ Universal Resource Locators ）：统一资源定位器，相当于网页的一个唯一ID，提供在web上进入目标资源的统一方法和路径 HTTP ( Hypertext Transfer Protocol )：一种在网络上传输数据的协议，专门用于以超文本或超媒体的形式提供的信息 HTML ( Hypertext Markup Language ):一种文本类、依靠解释的方式执行的超文本标记语言，主要用作编写网页；可以直接用任何文本编辑器打开，查看HTML源码，无需编译直接解释执行 HTML文件的基本结构&lt;html&gt; &lt;head&gt; &lt;title&gt;文件标题&lt;/title&gt;","categories":[{"name":"HTML","slug":"HTML","permalink":"https://wanghaoranv.github.io/categories/HTML/"}],"tags":[{"name":"HTML","slug":"HTML","permalink":"https://wanghaoranv.github.io/tags/HTML/"},{"name":"前端","slug":"前端","permalink":"https://wanghaoranv.github.io/tags/%E5%89%8D%E7%AB%AF/"}]},{"title":"英语写作练习（一）","slug":"英语写作练习(一)","date":"2020-03-11T03:05:31.000Z","updated":"2020-04-04T15:26:50.727Z","comments":true,"path":"2020/03/11/英语写作练习(一)/","link":"","permalink":"https://wanghaoranv.github.io/2020/03/11/%E8%8B%B1%E8%AF%AD%E5%86%99%E4%BD%9C%E7%BB%83%E4%B9%A0(%E4%B8%80)/","excerpt":"Wirting：The importance of building trust between employers and employees Translation: 私家车","text":"Wirting：The importance of building trust between employers and employees Translation: 私家车 英语写作，每周至少一篇，此为第一篇 Writing 第一段观点：employees(雇员)与employers(雇主)之间相互信任有助于公司更好发展 第二段具体阐述：提高了工作效率；人与人之间关系更融洽； 结尾重申：彼此信任合作共赢 improve work efficiency/more harmonious relationship between employers and employees Model Essay: It is an undeniable[1] fact that trust can lay a solid foundation for commercial activities.Therefore, building trust between employees and employers plays a crucial[2] role in boosting an organization.To begin with, as the saying goes, the best bosses understand the art of delegation[3]. If a boss believes in his staff and tries his best to delegate insteadof micromanaging[4], this kind of belief can drive him to create an environment where empleyees would have more passion for work and work more efficiently. Next, with trust, employers and emplyees can achieve mutual consensus[5], build harmonious cooperation and have effective communication, which is benificial to creating a pleasant working atmosphere. In this way, not surprisingly[6], the two parties can directly promote the rapid progress of the organization and indirectly spur continuous development of the individuals. Taking into account what we have discussed above, we may safely arrive at a conclusion that it is sensible for both employers and employees to keep in mind that mutual trust contributes to realizing a win-win situation. Details:[1] : a.不可否认的；确凿的[ˌʌndɪˈnaɪəbl][2] : a.至关重要的[3] : n.代表；委托；授权[ˌdelɪˈɡeɪʃn][4] : 微观管理；事必躬亲；[5] : 相互协调一致;a.[ˈmjuːtʃuəl] 相互的；n.[kənˈsensəs]一致的意见[6] : 不是故意的it is an undeniable fact that…play a crucial role in boosting organizationthis kind of belief can drive…to Translation 过去，拥有一辆私家车对大部分中国人而言是件奢侈的事。如今，私家车在中国随处可见。In the past years, it is a extravagant【a.奢侈的[ɪkˈstrævəɡənt]】 thing for most Chinese to owned a car.But now, private cars are seen anywhere.In the past, owning a private car was a luxury【n./v.奢侈品[ˈlʌkʃəri]】 thing for most Chinese.Nowdays, private cars can be seen everywhere in China.","categories":[],"tags":[{"name":"英语学习","slug":"英语学习","permalink":"https://wanghaoranv.github.io/tags/%E8%8B%B1%E8%AF%AD%E5%AD%A6%E4%B9%A0/"}]},{"title":"足球复盘：切尔西vs拜仁","slug":"19-20欧冠1-8切尔西vs拜仁","date":"2020-02-26T06:07:12.000Z","updated":"2020-04-04T15:04:44.544Z","comments":true,"path":"2020/02/26/19-20欧冠1-8切尔西vs拜仁/","link":"","permalink":"https://wanghaoranv.github.io/2020/02/26/19-20%E6%AC%A7%E5%86%A01-8%E5%88%87%E5%B0%94%E8%A5%BFvs%E6%8B%9C%E4%BB%81/","excerpt":"19-20赛季欧冠八分之一决赛，切尔西主场对阵拜仁慕尼黑，最终比分 0 ：3","text":"19-20赛季欧冠八分之一决赛，切尔西主场对阵拜仁慕尼黑，最终比分 0 ：3 第一次公开尝试足球复盘系列，坦白讲，足球战术十分复杂，从很多方面都可以落笔展开，宏观的战术布置、阵型轮转变化，微观的球员临场处理、相互配合……鉴于水平有限，观看比赛又往往局限于自己喜爱的球队，加上分析需要大量的图片或动图，只能粗略地以某一队为主写一点，不太详细，当中肯定有不准确的地方。就当作爱好来看吧，下面开始第一篇。 前沿北京时间2020年2月26日，欧冠十六进八决赛，拜仁慕尼黑客场来到伦敦斯坦福桥挑战切尔西，前者在换帅后有一波强势反弹，暂时登上了德甲头名，赛前信心十足，被广泛看好；东道主切尔西由于转会禁令，大幅启用年轻球员，整个赛季都不太稳定，只不过上一场比赛刚刚击败了热刺。 关于两队的伤病情况，都不太乐观，切尔西损失了中场核心坎特，这对他们的整体实力影响较大，还有奥多伊、普利希奇因伤不能出场；拜仁慕尼黑的伤病问题一直很严重，过去很多重要比赛都一定程度受伤病影响，这场比赛，聚勒、佩里西奇、卢卡斯、哈维马丁内斯皆因伤缺阵，后防线采用拼凑的组合。 首发阵容 首发， 图源：刘强专栏 切尔西摆出了3-4-3，三后卫阵型，与孔蒂时代有些类似，具体因为不怎么看切尔西，所以本文以拜仁为主进行分析。 拜仁慕尼黑则采用了“以我为主”的战术选择——熟悉的、使用频率高的4-2-3-1阵型，这套打法在多位主帅的打磨下显然比较成熟，球员也更能适应，更能发挥。 打法浅析前面说到，拜仁使用4-2-3-1，其发挥攻击力关键在于前场进攻三人组与顶在最前面的大中锋莱万多夫斯基来回穿插配合，这位全能的德甲小钢炮发挥了远超于普通中锋的战术作用，几位前场攻击手在他的接应下踢得都很舒服。右边锋科曼刚刚伤愈，可以明显看出这场比赛他的状态不佳，有点十分想表现却力不从心的感觉，不过他的速度依然是对方十分忌惮的进攻武器。左边格纳布里倒是状态不错，取得了两粒进球，在他熟悉的地方，这位从伦敦走出来的边锋正以肉眼可见的速度成长。其实说来奇怪，这两位边锋原本都踢的是相反的一边，记不清从什么时候开始换位，从几场比赛来看效果还不错。此外，非传统前腰穆勒在他最喜欢的位置上，跑位，接应，有着“球混子”属性的他这场比赛活动范围很大，与莱万交替换位，与两边换位，回到中场压迫……起到了前场润滑剂的效果。 中间使用了蒂亚戈和基米希两位技术型中场，也常常被形容为“文官中场”，含义不难理解，与武官相对应，技术型中场往往小技术出色，具有一定的摆脱调度能力，而强硬的身体、拦截等“武官”中场的特点则相对不具备。这两位技术型后腰：蒂亚戈曾自己在采访中说过，更喜欢10号位的工作，即进攻的组织核心，偏前腰偏攻击，而不是防守拦截；另一位基米希，原本踢右边后卫的时候就攻强于守，不想安分呆在后场，直接踢成了右边翼位，现在改到自己想尝试的后腰位。所以综上，拜仁的两位后腰都长于进攻，少了一点硬度，少了一点传统后腰的防守力，而且这两位的身高都不高，后场的高球保护更是一个难点。 为了避免可能出现的防守问题，解决方案也很简单——全队压迫，从几位进攻手开始，防守时莱万与穆勒总有一位回撤干扰，另一位就默契的顶到前面，中场及后场球员更不用说，往往在丢球的时刻立即开始反抢，从赛后数据来看，进攻手格纳布里抢断竟达到六次，全场最高，蒂亚戈全场拦截也达到了五次。中后卫阿拉巴的运动能力很强，这场比赛常常能看到他向前防守，甚至带球向前，而另一位中后卫博阿滕位置相对靠后，不再贸然向前，防止因为自己速度慢被打身后，起着站桩防高球争顶的作用。此前他一直因为年龄增长状态下滑而饱受批评，说实话我个人有点不忍心，一路辉煌一路坎坷走过来，给这位功勋一点时间吧。往往年轻时依靠身体的中后卫，在30岁过后大多逃不掉退步的后果。再看看两个边后卫，帕瓦尔表现中规中矩，助攻传中都有点勉强，另一位戴维斯则让人眼前一亮，身体素质优秀，速度快，能助攻，几次防守就算有点失位，最后也能依靠速度追上弥补，进攻更不用说，前锋出身有突破，此役也贡献了一粒一条龙助攻。况且他才十九岁，前途无限，有着年轻人初生牛犊不怕虎的劲头，只是有点担心这种踢法以后会带来伤病…… 赛况45+1：蒂亚戈黄牌 49：基米希、若日尼奥黄牌 51：格纳布里进球、莱万助攻 54：格纳布里进球、莱万助攻 61：亚伯拉罕换吉鲁，威廉换巴克利 66：库蒂尼奥换科曼 73：佩德罗换阿斯皮利奎塔 76：莱万进球、戴维斯助攻 83：马科斯阿隆索红牌 85：托利索换格纳布里 90：格雷茨卡换蒂亚戈 赛后评分 总结此役，在拜仁后场强大的后场“发牌”能力下，切尔西的机会并不多，如果说上半场两队互有攻守，那么下半场在拜仁第一粒进球后局势变得很明朗。拜仁在进攻端充分利用了边中转移的策略，但赢球更重要的原因还是两队存在一定的实力差距。次回合只要稳扎稳打，晋级可期。 不过，赛后莱万被报道骨折休战至少四周，科曼赛程中也伤退，给本该值得庆祝的胜利蒙上了一层阴影。","categories":[],"tags":[{"name":"足球复盘","slug":"足球复盘","permalink":"https://wanghaoranv.github.io/tags/%E8%B6%B3%E7%90%83%E5%A4%8D%E7%9B%98/"}]},{"title":"Hexo+Github搭建博客简易指南","slug":"Hexo-Github搭建博客简易指南","date":"2020-02-19T12:43:03.000Z","updated":"2020-04-04T15:04:13.786Z","comments":true,"path":"2020/02/19/Hexo-Github搭建博客简易指南/","link":"","permalink":"https://wanghaoranv.github.io/2020/02/19/Hexo-Github%E6%90%AD%E5%BB%BA%E5%8D%9A%E5%AE%A2%E7%AE%80%E6%98%93%E6%8C%87%E5%8D%97/","excerpt":"与其说是指南，不如说是自己搭建过程的总结，以及遇到问题的记录","text":"与其说是指南，不如说是自己搭建过程的总结，以及遇到问题的记录，因为这个博客采用了比较省事的搭建方式，自己也实在没有能力出一个完整的教程。 要想搭建一个博客，实际上就是一个网站，内容界面可以自己开发设计，重要的是，要获取个人独有的域名和提供响应服务器。因此，博客搭建大致分成两个部分，其一：在本地构建好网页，设计好界面；其二：将个人域名与网页绑定，推到远端服务器，让别人可以从互联网上访问。 网页网页一般可分为两种——静态网页和动态网页，静态网页并不是指没有动画的网页，而是指网页的所有内容文件直接存储保存在服务器上，每次用户发出访问请求，服务器无需编译，直接将文件内容加载到浏览器上显示出来，动态网页则不然，动态网页收到用户请求后，服务器上会运行程序，调用、生成一些内容（数据、页面文件……），然后返回给用户显示出结果，网页会根据用户的要求和选择而动态地改变和响应，不同人，不同时间访问，返回结果都不一定相同。 举个例子，本博客就是一个静态网页，不管谁访问都显示相同的内容，每次修改，都是直接在文件上改变，每次修改都需要重新发布（相当于覆盖）；而像学校的教务系统，微博等，不同用户、不同时候访问，其结果都不尽相同，是典型的动态网页，服务器端的程序会自动运行并更换内容（相当于调整）。 因此，静态网页把主要任务都交给用户端的浏览器加载，而动态网页对远端服务器的处理能力要求更高，两者最主要的区别是，是否在服务器上有程序运行。只有动态服务器才能使用数据库，因此能实现功能更多，如：用户注册，登录，订单管理等等，运用也更广泛，当然，动态静态并非互不相容，可以混合使用。还有，静态网页每个网页都有一个固定的URL,且网页URL以.htm、.html、.shtml等常见形式为后缀，不含有“？”。 服务器与域名回到博客的创建，我们需要一个服务器，服务器与我们平时使用的PC并无太大差别，只是更强调稳定性和性能，可以选择用一台闲置电脑，不过要保持一直开机，随时供人访问。还可以选择花钱购买云主机，像阿里云 、腾讯云 等，都提供了这样的服务。本博选择了一种免费的方式，就是利用代码协作开发平台，常见的有Github、码云Gitee等，这些平台就是代码仓库，人们将代码上传分享，可以将服务器托管在这些平台上。 除了服务器我们还需要一个没注册过的域名，当然每个人都希望自己的域名有个性一点，获取方式很简单，就是花钱买 又要买？，阿里云腾讯云也提供了这样的服务，也还有一种免费的方式，和前面一样，这些平台会提供给你一个域名，可以部分自己取，总之，这些平台还算稳定，也免费，对于搭建个人博客，足够使用。本博客托管在Github上，服务器在国外，国内访问速度会有影响，其他的一些国内平台速度会快一些。 网页框架搭建构建网页设计界面的过程，也就是常说的前端工程师完成的部分，本博客直接使用网上别人已经开发好的框架和主题。 常见的框架有： WordPress：动态框架，基于PHP语言 Heox：静态框架，基于JavaScript语言 Jekyll：静态框架，基于Ruby语言 Hugo：静态框架，基于Go语言 本博客采用Hexo框架，具体步骤官方网站上写得比较清楚Hexo官方文档，在这我就大致复盘一下，主要记录我遇到的问题 安装Hexo首先需要安装一些环境：Git:直接在官网下载，如果下载速度极慢，需要用到淘宝镜像源，具体地址官方文档有,上面已给出链接。Git到底是什么？我也没能太理解，似乎是一个分布式版本系统，可以控制代码版本，相当于作为仓库保存修改前修改后的内容。听职场程序员说，Git在工作中用处很大，很重要。下图是Git工作原理: 注：Workspace:工作区; Index:暂存区; Repository:本地仓库; Remote:远程仓库,图源知乎 Node.js：直接在官网下载，如果安装速度极慢，同样需要淘宝镜像源。Node.js 是Javascript（开发Web页面的脚本语言）的运行环境，是一个前端的框架，能够让JavaScript在服务端运行。 以上两个工具安装完成后，正式开始安装Hexo，具体步骤指令可参照官方文档。安装完成后，可以使用 hexo s指令，利用本地服务器4000端口，测试加载情况，这时应看到初始的博客，后续的主题使用配置，可以在官网的主题页里进行选择。 Github众所周知Github是一款全球流行的同性交友软件，使用前需要绑定邮箱进行注册。注意，你注册的用户名，以后会用作域名的一部分，不要太随意就行。注册完成后新建一个仓库，仓库名一定要以：你的用户名.github.io 命名，否则不能成功，这就是你博客的域名。新建仓库后可以在Setting里设置发布，这时，你在网页上输入域名，就可以看到初始的页面。如果有能力可以在这个仓库里写进代码，自己设计创建网页，但这里我就导入前面部署好的Hexo框架。 配置SSH密钥两部分都准备好了之后，我们还要配置SSH密钥，具体含义我不太理解，这里直接放出网上找的资料： SSH是建立在应用层和传输层基础上的安全协议，其目的是专为远程登录会话和其他网络服务提供安全性的保障，用过SSH远程登录的人都比较熟悉，可以认为SSH是一种安全的Shell。 SSH登录是需要用户名和密码的，要实现无密码登录，就需要创建SSH 密钥（ssh key），SSH 密钥可以认为是和另一台电脑通信时的唯一的识别证，SSH 密钥对可以让我们方便的登录到 SSH 服务器，而无需输入密码——来源见文末[01] 使用配置的命令必须要在Git Bash中执行，首先执行ls -l ~/.ssh，检查密钥是否存在，然后执行ssh-keygen -t rsa -C &quot;your_email@example.com&quot;生成新的密钥，这里的邮箱是你注册Github时绑定的，运行过程要敲三次回车，回车实际上就是将密码之类的设为空。这时你的电脑会生成.ssh文件，可以到/.ssh目录（一般在C盘用户目录下，如果找不到可以在C盘直接搜索）下查看相关文件，一般来说ssh密钥会包含id_rsa和id_rsa.pub两个文件，分别表示生成的私钥和公钥。然后用记事本打开公钥id_rsa.pub，将所有内容，复制到Github &gt;Setting &gt;SSH and GPG keys 里，title随意取，key为刚复制的公钥，添加密钥。当中可能有一步要在Git Bash上绑定用户名和邮箱，具体情况视报错提示而定。 部署最后的部署要使用hexo-deployer-git插件，具体步骤和指令Hexo官方文档有，一键部署。之后同样根据文档修改配置就大功告成了。使用的主题样式可以自由选择，很多功能还要自己慢慢摸索，以后也可以学习前端的知识修改别人的主题，自己设计。 如果读者发现了错误，可以联系我指正，相互交流这是第一篇长文，可真难写啊 参考资料[01]. https://www.jianshu.com/p/7aba9b127cb8[02]. https://www.jianshu.com/p/c9295bacd98b[03]. Hexo官方文档[04]. CSDN[05]. 百度百科[06]. B站_CodeSheep[07]. B站_hujun_cn","categories":[{"name":"指南","slug":"指南","permalink":"https://wanghaoranv.github.io/categories/%E6%8C%87%E5%8D%97/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"https://wanghaoranv.github.io/tags/Hexo/"},{"name":"网页","slug":"网页","permalink":"https://wanghaoranv.github.io/tags/%E7%BD%91%E9%A1%B5/"},{"name":"博客搭建","slug":"博客搭建","permalink":"https://wanghaoranv.github.io/tags/%E5%8D%9A%E5%AE%A2%E6%90%AD%E5%BB%BA/"}]},{"title":"写在前面","slug":"写在前面","date":"2020-02-17T16:00:00.000Z","updated":"2020-02-21T12:11:56.263Z","comments":true,"path":"2020/02/18/写在前面/","link":"","permalink":"https://wanghaoranv.github.io/2020/02/18/%E5%86%99%E5%9C%A8%E5%89%8D%E9%9D%A2/","excerpt":"","text":"写在博客创建之初就像每本书都有它的前言，自己的博客也在创建之初写下一些话吧。很久前就想创建博客，去年有幸接触了一群已经身在职场的程序员，第一次看到别人精致、有态度的博客，更加坚定了自己搭建的想法。搭建的过程比较曲折，问题不断，好在最近时间充裕，慢慢修改，最终还是有了结果。其实回头来看，创建的过程远比现在写内容有意思的多，希望自己能一直坚持更新，虽然以后也不一定能从事代码有关的工作，但生活总是自己的，值得永远学习探索。平日里虽也时不时写点东西，但文笔依旧很烂，只能追求每一篇博文尽量表达清楚。我深知博客是别人看的，有价值的内容是重中之重，无奈目前才疏学浅，就暂且把这儿当作学习知识的踩坑记录吧。另外，本博客暂时是托管在Github上，国内访问速度比较慢，未来可能会找机会购买域名和服务器，进行迁移。 真的很喜欢当年明月先生《明朝那些事儿》结尾的那段话，放在这里： 此前，我讲过很多东西，很多兴衰起落、很多王侯将相、很多无奈更替、很多风云变幻，但这件东西，我个人认为，是最重要的。因为我要告诉你，所谓千秋霸业，万古流芳，以及一切的一切，只是粪土。先变成粪，再变成土。现在你不明白，将来你会明白，将来不明白，就再等将来，如果一辈子都不明白，也行。而最后讲述的这件东西，它超越上述的一切，至少在我看来。但这件东西，我想了很久，也无法用准确的语言，或是词句来表达，用最欠揍的话说，是只可意会，不可言传。然而我终究是不欠揍的，在遍阅群书，却无从开口之后，我终于从一本不起眼，且无甚价值的读物上，找到了这句适合的话。这是一本台历，一本放在我面前，不知过了多久，却从未翻过，早已过期的台历。我知道，是上天把这本台历放在了我的桌前，它看着几年来我每天的努力，始终的坚持，它静静地，耐心地等待着终结。它等待着，在即将结束的那一天，我将翻开这本陪伴我始终，却始终未曾翻开的台历，在上面，有着最后的答案。我翻开了它，在这本台历上，写着一句连名人是谁都没说明白的名人名言。是的，这就是我想说的，这就是我想通过徐霞客所表达的，足以藐视所有王侯将相，最完美的结束语：成功只有一个——按照自己的方式，去度过人生。 当年明月—— 《明朝那些事儿》 祝愿我能用短暂的生命，去贴一贴这个星球的嶙峋一角。","categories":[{"name":"杂谈","slug":"杂谈","permalink":"https://wanghaoranv.github.io/categories/%E6%9D%82%E8%B0%88/"}],"tags":[{"name":"写在前面","slug":"写在前面","permalink":"https://wanghaoranv.github.io/tags/%E5%86%99%E5%9C%A8%E5%89%8D%E9%9D%A2/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-02-15T16:00:00.000Z","updated":"2020-02-18T09:03:32.452Z","comments":true,"path":"2020/02/16/hello-world/","link":"","permalink":"https://wanghaoranv.github.io/2020/02/16/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. 你好，欢迎来到我的博客Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}